[
  {
    "name": "3d-web-experience",
    "category": "Frontend",
    "description": "\"Expert in building 3D experiences for the web - Three.js, React Three Fiber, Spline, WebGL, and interactive 3D scenes. Covers product configurators, 3D portfolios, immersive websites, and bringing depth to web experiences. Use when: 3D website, three.js, WebGL, react three fiber, 3D experience.\"",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ab-test-setup",
    "category": "Frontend",
    "description": "Structured guide for setting up A/B tests with mandatory gates for hypothesis, metrics, and execution readiness.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "accessibility-compliance-accessibility-audit",
    "category": "Frontend",
    "description": "\"You are an accessibility expert specializing in WCAG compliance, inclusive design, and assistive technology compatibility. Conduct audits, identify barriers, and provide remediation guidance.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Active Directory Attacks",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"attack Active Directory\", \"exploit AD\", \"Kerberoasting\", \"DCSync\", \"pass-the-hash\", \"BloodHound enumeration\", \"Golden Ticket\", \"Silver Ticket\", \"AS-REP roasting\", \"NTLM relay\", or needs guidance on Windows domain penetration testing.",
    "tags": [
      "UI",
      "AI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "activecampaign-automation",
    "category": "AI & Agents",
    "description": "\"Automate ActiveCampaign tasks via Rube MCP (Composio): manage contacts, tags, list subscriptions, automation enrollment, and tasks. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "address-github-comments",
    "category": "Development",
    "description": "Use when you need to address review or issue comments on an open GitHub Pull Request using the gh CLI.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "agent-evaluation",
    "category": "AI & Agents",
    "description": "\"Testing and benchmarking LLM agents including behavioral testing, capability assessment, reliability metrics, and production monitoring—where even top agents achieve less than 50% on real-world benchmarks Use when: agent testing, agent evaluation, benchmark agents, agent reliability, test agent.\"",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "agent-manager-skill",
    "category": "Frontend",
    "description": "Manage multiple local CLI agents via tmux sessions (start/stop/monitor/assign) with cron-friendly scheduling.",
    "tags": [
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "agent-memory-mcp",
    "category": "AI & Agents",
    "description": "A hybrid memory system that provides persistent, searchable knowledge management for AI agents (Architecture, Patterns, Decisions).",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "agent-memory-systems",
    "category": "AI & Agents",
    "description": "\"Memory is the cornerstone of intelligent agents. Without it, every interaction starts from zero. This skill covers the architecture of agent memory: short-term (context window), long-term (vector stores), and the cognitive architectures that organize them.  Key insight: Memory isn't just storage - it's retrieval. A million stored facts mean nothing if you can't find the right one. Chunking, embedding, and retrieval strategies determine whether your agent remembers or forgets.  The field is fragm\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "agent-orchestration-improve-agent",
    "category": "AI & Agents",
    "description": "\"Systematic improvement of existing agents through performance analysis, prompt engineering, and continuous iteration.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "agent-orchestration-multi-agent-optimize",
    "category": "AI & Agents",
    "description": "\"Optimize multi-agent systems with coordinated profiling, workload distribution, and cost-aware orchestration. Use when improving agent performance, throughput, or reliability.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "agent-tool-builder",
    "category": "Frontend",
    "description": "\"Tools are how AI agents interact with the world. A well-designed tool is the difference between an agent that works and one that hallucinates, fails silently, or costs 10x more tokens than necessary.  This skill covers tool design from schema to error handling. JSON Schema best practices, description writing that actually helps the LLM, validation, and the emerging MCP standard that's becoming the lingua franca for AI tools.  Key insight: Tool descriptions are more important than tool implementa\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ai-agents-architect",
    "category": "Frontend",
    "description": "\"Expert in designing and building autonomous AI agents. Masters tool use, memory systems, planning strategies, and multi-agent orchestration. Use when: build agent, AI agent, autonomous agent, tool use, function calling.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ai-engineer",
    "category": "Frontend",
    "description": "Build production-ready LLM applications, advanced RAG systems, and",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ai-product",
    "category": "Frontend",
    "description": "\"Every product will be AI-powered. The question is whether you'll build it right or ship a demo that falls apart in production.  This skill covers LLM integration patterns, RAG architecture, prompt engineering that scales, AI UX that users trust, and cost optimization that doesn't bankrupt you. Use when: keywords, file_patterns, code_patterns.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ai-wrapper-product",
    "category": "Frontend",
    "description": "\"Expert in building products that wrap AI APIs (OpenAI, Anthropic, etc.) into focused tools people will pay for. Not just 'ChatGPT but different' - products that solve specific problems with AI. Covers prompt engineering for products, cost management, rate limiting, and building defensible AI businesses. Use when: AI wrapper, GPT product, AI tool, wrap AI, AI SaaS.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "airflow-dag-patterns",
    "category": "Frontend",
    "description": "Build production Apache Airflow DAGs with best practices for operators, sensors, testing, and deployment. Use when creating data pipelines, orchestrating workflows, or scheduling batch jobs.",
    "tags": [
      "UI",
      "AI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "airtable-automation",
    "category": "AI & Agents",
    "description": "\"Automate Airtable tasks via Rube MCP (Composio): records, bases, tables, fields, views. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "algolia-search",
    "category": "Frontend",
    "description": "\"Expert patterns for Algolia search implementation, indexing strategies, React InstantSearch, and relevance tuning Use when: adding search to, algolia, instantsearch, search api, search functionality.\"",
    "tags": [
      "React",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "algorithmic-art",
    "category": "Development",
    "description": "Creating algorithmic art using p5.js with seeded randomness and interactive parameter exploration. Use this when users request creating art using code, generative art, algorithmic art, flow fields, or particle systems. Create original algorithmic art rather than copying existing artists' work to avoid copyright violations.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "amplitude-automation",
    "category": "Automation",
    "description": "\"Automate Amplitude tasks via Rube MCP (Composio): events, user activity, cohorts, user identification. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "analytics-tracking",
    "category": "Data & Analytics",
    "description": ">",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "angular",
    "category": "Frontend",
    "description": ">-",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "angular-best-practices",
    "category": "Frontend",
    "description": "Angular performance optimization and best practices guide. Use when writing, reviewing, or refactoring Angular code for optimal performance, bundle size, and rendering efficiency.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "angular-migration",
    "category": "Frontend",
    "description": "Migrate from AngularJS to Angular using hybrid mode, incremental component rewriting, and dependency injection updates. Use when upgrading AngularJS applications, planning framework migrations, or modernizing legacy Angular code.",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "angular-state-management",
    "category": "Frontend",
    "description": "Master modern Angular state management with Signals, NgRx, and RxJS. Use when setting up global state, managing component stores, choosing between state solutions, or migrating from legacy patterns.",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "angular-ui-patterns",
    "category": "Frontend",
    "description": "Modern Angular UI patterns for loading states, error handling, and data display. Use when building UI components, handling async data, or managing component states.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "anti-reversing-techniques",
    "category": "Security",
    "description": "Understand anti-reversing, obfuscation, and protection techniques encountered during software analysis. Use when analyzing protected binaries, bypassing anti-debugging for authorized analysis, or understanding software protection mechanisms.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "api-design-principles",
    "category": "Frontend",
    "description": "Master REST and GraphQL API design principles to build intuitive, scalable, and maintainable APIs that delight developers. Use when designing new APIs, reviewing API specifications, or establishing API design standards.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "api-documentation-generator",
    "category": "Backend",
    "description": "\"Generate comprehensive, developer-friendly API documentation from code, including endpoints, parameters, examples, and best practices\"",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "api-documenter",
    "category": "Backend",
    "description": "Master API documentation with OpenAPI 3.1, AI-powered tools, and",
    "tags": [
      "API",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "API Fuzzing for Bug Bounty",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"test API security\", \"fuzz APIs\", \"find IDOR vulnerabilities\", \"test REST API\", \"test GraphQL\", \"API penetration testing\", \"bug bounty API testing\", or needs guidance on API security assessment techniques.",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "api-patterns",
    "category": "Frontend",
    "description": "API design principles and decision-making. REST vs GraphQL vs tRPC selection, response formats, versioning, pagination.",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "api-security-best-practices",
    "category": "Frontend",
    "description": "\"Implement secure API design patterns including authentication, authorization, input validation, rate limiting, and protection against common API vulnerabilities\"",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "api-testing-observability-api-mock",
    "category": "Frontend",
    "description": "\"You are an API mocking expert specializing in realistic mock services for development, testing, and demos. Design mocks that simulate real API behavior and enable parallel development.\"",
    "tags": [
      "UI",
      "API",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "app-builder",
    "category": "Frontend",
    "description": "Main application building orchestrator. Creates full-stack applications from natural language requests. Determines project type, selects tech stack, coordinates agents.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "app-store-optimization",
    "category": "Mobile",
    "description": "Complete App Store Optimization (ASO) toolkit for researching, optimizing, and tracking mobile app performance on Apple App Store and Google Play Store",
    "tags": [
      "Mobile"
    ],
    "categorySlug": "mobile"
  },
  {
    "name": "application-performance-performance-optimization",
    "category": "Frontend",
    "description": "\"Optimize end-to-end application performance with profiling, observability, and backend/frontend tuning. Use when coordinating performance optimization across the stack.\"",
    "tags": [
      "UI",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "architect-review",
    "category": "Development",
    "description": "Master software architect specializing in modern architecture",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "architecture",
    "category": "Frontend",
    "description": "Architectural decision-making framework. Requirements analysis, trade-off evaluation, ADR documentation. Use when making architecture decisions or analyzing system design.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "architecture-decision-records",
    "category": "AI & Agents",
    "description": "Write and maintain Architecture Decision Records (ADRs) following best practices for technical decision documentation. Use when documenting significant technical decisions, reviewing past architectural choices, or establishing decision processes.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "architecture-patterns",
    "category": "Frontend",
    "description": "Implement proven backend architecture patterns including Clean Architecture, Hexagonal Architecture, and Domain-Driven Design. Use when architecting complex backend systems or refactoring existing applications for better maintainability.",
    "tags": [
      "UI",
      "AI",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "arm-cortex-expert",
    "category": "Development",
    "description": ">",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "asana-automation",
    "category": "Automation",
    "description": "\"Automate Asana tasks via Rube MCP (Composio): tasks, projects, sections, teams, workspaces. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "async-python-patterns",
    "category": "Frontend",
    "description": "Master Python asyncio, concurrent programming, and async/await patterns for high-performance applications. Use when building async APIs, concurrent systems, or I/O-bound applications requiring non-blocking operations.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "attack-tree-construction",
    "category": "Frontend",
    "description": "Build comprehensive attack trees to visualize threat paths. Use when mapping attack scenarios, identifying defense gaps, or communicating security risks to stakeholders.",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "audio-transcriber",
    "category": "AI & Agents",
    "description": "\"Transform audio recordings into professional Markdown documentation with intelligent summaries using LLM integration\"",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "auth-implementation-patterns",
    "category": "Frontend",
    "description": "Master authentication and authorization patterns including JWT, OAuth2, session management, and RBAC to build secure, scalable access control systems. Use when implementing auth systems, securing APIs, or debugging security issues.",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "automate-whatsapp",
    "category": "Frontend",
    "description": "\"Build WhatsApp automations with Kapso workflows: configure WhatsApp triggers, edit workflow graphs, manage executions, deploy functions, and use databases/integrations for state. Use when automating WhatsApp conversations and event handling.\"",
    "tags": [
      "UI",
      "Automation",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "autonomous-agent-patterns",
    "category": "Frontend",
    "description": "\"Design patterns for building autonomous coding agents. Covers tool integration, permission systems, browser automation, and human-in-the-loop workflows. Use when building AI agents, designing tool APIs, implementing permission systems, or creating autonomous coding assistants.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "autonomous-agents",
    "category": "Frontend",
    "description": "\"Autonomous agents are AI systems that can independently decompose goals, plan actions, execute tools, and self-correct without constant human guidance. The challenge isn't making them capable - it's making them reliable. Every extra decision multiplies failure probability.  This skill covers agent loops (ReAct, Plan-Execute), goal decomposition, reflection patterns, and production reliability. Key insight: compounding error rates kill autonomous agents. A 95% success rate per step drops to 60% b\"",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "avalonia-layout-zafiro",
    "category": "Frontend",
    "description": "Guidelines for modern Avalonia UI layout using Zafiro.Avalonia, emphasizing shared styles, generic components, and avoiding XAML redundancy.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "avalonia-viewmodels-zafiro",
    "category": "Frontend",
    "description": "Optimal ViewModel and Wizard creation patterns for Avalonia using Zafiro and ReactiveUI.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "avalonia-zafiro-development",
    "category": "Frontend",
    "description": "Mandatory skills, conventions, and behavioral rules for Avalonia UI development using the Zafiro toolkit.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "AWS Penetration Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"pentest AWS\", \"test AWS security\", \"enumerate IAM\", \"exploit cloud infrastructure\", \"AWS privilege escalation\", \"S3 bucket testing\", \"metadata SSRF\", \"Lambda exploitation\", or needs guidance on Amazon Web Services security assessment.",
    "tags": [
      "UI",
      "Security",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "aws-serverless",
    "category": "Frontend",
    "description": "\"Specialized skill for building production-ready serverless applications on AWS. Covers Lambda functions, API Gateway, DynamoDB, SQS/SNS event-driven patterns, SAM/CDK deployment, and cold start optimization.\"",
    "tags": [
      "UI",
      "API",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "aws-skills",
    "category": "Automation",
    "description": "\"AWS development with infrastructure automation and cloud architecture patterns\"",
    "tags": [
      "Automation",
      "Cloud"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "azure-functions",
    "category": "Backend",
    "description": "\"Expert patterns for Azure Functions development including isolated worker model, Durable Functions orchestration, cold start optimization, and production patterns. Covers .NET, Python, and Node.js programming models. Use when: azure function, azure functions, durable functions, azure serverless, function app.\"",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "backend-architect",
    "category": "Frontend",
    "description": "Expert backend architect specializing in scalable API design,",
    "tags": [
      "UI",
      "API",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "backend-dev-guidelines",
    "category": "Frontend",
    "description": "Opinionated backend development standards for Node.js + Express + TypeScript microservices. Covers layered architecture, BaseController pattern, dependency injection, Prisma repositories, Zod validation, unifiedConfig, Sentry error tracking, async safety, and testing discipline.",
    "tags": [
      "Testing",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "backend-development-feature-development",
    "category": "Frontend",
    "description": "\"Orchestrate end-to-end backend feature development from requirements to deployment. Use when coordinating multi-phase feature delivery across teams and services.\"",
    "tags": [
      "UI",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "backend-security-coder",
    "category": "Backend",
    "description": "Expert in secure backend coding practices specializing in input",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "backtesting-frameworks",
    "category": "Frontend",
    "description": "Build robust backtesting systems for trading strategies with proper handling of look-ahead bias, survivorship bias, and transaction costs. Use when developing trading algorithms, validating strategies, or building backtesting infrastructure.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "bamboohr-automation",
    "category": "Automation",
    "description": "\"Automate BambooHR tasks via Rube MCP (Composio): employees, time-off, benefits, dependents, employee updates. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "basecamp-automation",
    "category": "Automation",
    "description": "\"Automate Basecamp project management, to-dos, messages, people, and to-do list organization via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "bash-defensive-patterns",
    "category": "Frontend",
    "description": "Master defensive Bash programming techniques for production-grade scripts. Use when writing robust shell scripts, CI/CD pipelines, or system utilities requiring fault tolerance and safety.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "bash-linux",
    "category": "Frontend",
    "description": "Bash/Linux terminal patterns. Critical commands, piping, error handling, scripting. Use when working on macOS or Linux systems.",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "bash-pro",
    "category": "Automation",
    "description": "Master of defensive Bash scripting for production automation, CI/CD",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "bats-testing-patterns",
    "category": "Frontend",
    "description": "Master Bash Automated Testing System (Bats) for comprehensive shell script testing. Use when writing tests for shell scripts, CI/CD pipelines, or requiring test-driven development of shell utilities.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "bazel-build-optimization",
    "category": "Frontend",
    "description": "Optimize Bazel builds for large-scale monorepos. Use when configuring Bazel, implementing remote execution, or optimizing build performance for enterprise codebases.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "beautiful-prose",
    "category": "AI & Agents",
    "description": "\"Hard-edged writing style contract for timeless, forceful English prose without AI tics\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "behavioral-modes",
    "category": "AI & Agents",
    "description": "AI operational modes (brainstorm, implement, debug, review, teach, ship, orchestrate). Use to adapt behavior based on task type.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "billing-automation",
    "category": "Frontend",
    "description": "Build automated billing systems for recurring payments, invoicing, subscription lifecycle, and dunning management. Use when implementing subscription billing, automating invoicing, or managing recurring payment systems.",
    "tags": [
      "UI",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "binary-analysis-patterns",
    "category": "Development",
    "description": "Master binary analysis patterns including disassembly, decompilation, control flow analysis, and code pattern recognition. Use when analyzing executables, understanding compiled code, or performing static analysis on binaries.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "bitbucket-automation",
    "category": "Automation",
    "description": "\"Automate Bitbucket repositories, pull requests, branches, issues, and workspace management via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "blockchain-developer",
    "category": "Frontend",
    "description": "Build production-ready Web3 applications, smart contracts, and",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "blockrun",
    "category": "Data & Analytics",
    "description": "Use when user needs capabilities Claude lacks (image generation, real-time X/Twitter data) or explicitly requests external models (\"blockrun\", \"use grok\", \"use gpt\", \"dall-e\", \"deepseek\")",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "box-automation",
    "category": "Automation",
    "description": "\"Automate Box cloud storage operations including file upload/download, search, folder management, sharing, collaborations, and metadata queries via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation",
      "Cloud"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "brainstorming",
    "category": "AI & Agents",
    "description": ">",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "brand-guidelines",
    "category": "Frontend",
    "description": "Applies Anthropic's official brand colors and typography to any sort of artifact that may benefit from having Anthropic's look-and-feel. Use it when brand colors or style guidelines, visual formatting, or company design standards apply.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "brand-guidelines",
    "category": "Frontend",
    "description": "Applies Anthropic's official brand colors and typography to any sort of artifact that may benefit from having Anthropic's look-and-feel. Use it when brand colors or style guidelines, visual formatting, or company design standards apply.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "brevo-automation",
    "category": "AI & Agents",
    "description": "\"Automate Brevo (Sendinblue) tasks via Rube MCP (Composio): manage email campaigns, create/edit templates, track senders, and monitor campaign performance. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "Broken Authentication Testing",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"test for broken authentication vulnerabilities\", \"assess session management security\", \"perform credential stuffing tests\", \"evaluate password policies\", \"test for session fixation\", or \"identify authentication bypass flaws\". It provides comprehensive techniques for identifying authentication and session management weaknesses in web applications.",
    "tags": [
      "Security",
      "Testing",
      "Cloud"
    ],
    "categorySlug": "security"
  },
  {
    "name": "browser-automation",
    "category": "Backend",
    "description": "\"Browser automation powers web testing, scraping, and AI agent interactions. The difference between a flaky script and a reliable system comes down to understanding selectors, waiting strategies, and anti-detection patterns.  This skill covers Playwright (recommended) and Puppeteer, with patterns for testing, scraping, and agentic browser control. Key insight: Playwright won the framework war. Unless you need Puppeteer's stealth ecosystem or are Chrome-only, Playwright is the better choice in 202\"",
    "tags": [
      "API",
      "AI",
      "Automation"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "browser-extension-builder",
    "category": "Frontend",
    "description": "\"Expert in building browser extensions that solve real problems - Chrome, Firefox, and cross-browser extensions. Covers extension architecture, manifest v3, content scripts, popup UIs, monetization strategies, and Chrome Web Store publishing. Use when: browser extension, chrome extension, firefox addon, extension, manifest v3.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "bullmq-specialist",
    "category": "Backend",
    "description": "\"BullMQ expert for Redis-backed job queues, background processing, and reliable async execution in Node.js/TypeScript applications. Use when: bullmq, bull queue, redis queue, background job, job queue.\"",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "bun-development",
    "category": "Testing",
    "description": "\"Modern JavaScript/TypeScript development with Bun runtime. Covers package management, bundling, testing, and migration from Node.js. Use when working with Bun, optimizing JS/TS development speed, or migrating from Node.js to Bun.\"",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "Burp Suite Web Application Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"intercept HTTP traffic\", \"modify web requests\", \"use Burp Suite for testing\", \"perform web vulnerability scanning\", \"test with Burp Repeater\", \"analyze HTTP history\", or \"configure proxy for web testing\". It provides comprehensive guidance for using Burp Suite's core features for web application security testing.",
    "tags": [
      "UI",
      "Security",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "business-analyst",
    "category": "AI & Agents",
    "description": "Master modern business analysis with AI-powered analytics,",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "busybox-on-windows",
    "category": "Frontend",
    "description": "How to use a Win32 build of BusyBox to run many of the standard UNIX command line tools on Windows.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "c-pro",
    "category": "Development",
    "description": "Write efficient C code with proper memory management, pointer",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "c4-architecture-c4-architecture",
    "category": "Development",
    "description": "\"Generate comprehensive C4 architecture documentation for an existing repository/codebase using a bottom-up analysis approach.\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "c4-code",
    "category": "Development",
    "description": "Expert C4 Code-level documentation specialist. Analyzes code",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "c4-component",
    "category": "Development",
    "description": "Expert C4 Component-level documentation specialist. Synthesizes C4",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "c4-container",
    "category": "AI & Agents",
    "description": "Expert C4 Container-level documentation specialist. Synthesizes",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "c4-context",
    "category": "Development",
    "description": "Expert C4 Context-level documentation specialist. Creates",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "cal-com-automation",
    "category": "AI & Agents",
    "description": "\"Automate Cal.com tasks via Rube MCP (Composio): manage bookings, check availability, configure webhooks, and handle teams. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "calendly-automation",
    "category": "AI & Agents",
    "description": "\"Automate Calendly scheduling, event management, invitee tracking, availability checks, and organization administration via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "canva-automation",
    "category": "Frontend",
    "description": "\"Automate Canva tasks via Rube MCP (Composio): designs, exports, folders, brand templates, autofill. Always search tools first for current schemas.\"",
    "tags": [
      "UI",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "canvas-design",
    "category": "Frontend",
    "description": "Create beautiful visual art in .png and .pdf documents using design philosophy. You should use this skill when the user asks to create a poster, piece of art, design, or other static piece. Create original visual designs, never copying existing artists' work to avoid copyright violations.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "backend-patterns",
    "category": "Frontend",
    "description": "Backend architecture patterns, API design, database optimization, and server-side best practices for Node.js, Express, and Next.js API routes.",
    "tags": [
      "UI",
      "API",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "clickhouse-io",
    "category": "Backend",
    "description": "ClickHouse database patterns, query optimization, analytics, and data engineering best practices for high-performance analytical workloads.",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "coding-standards",
    "category": "Frontend",
    "description": "Universal coding standards, best practices, and patterns for TypeScript, JavaScript, React, and Node.js development.",
    "tags": [
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "cc-skill-continuous-learning",
    "category": "Development",
    "description": "Development skill from everything-claude-code",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "frontend-patterns",
    "category": "Frontend",
    "description": "Frontend development patterns for React, Next.js, state management, performance optimization, and UI best practices.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "cc-skill-project-guidelines-example",
    "category": "Frontend",
    "description": "Project Guidelines Skill (Example)",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "security-review",
    "category": "Backend",
    "description": "Use this skill when adding authentication, handling user input, working with secrets, creating API endpoints, or implementing payment/sensitive features. Provides comprehensive security checklist and patterns.",
    "tags": [
      "API",
      "Security"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "cc-skill-strategic-compact",
    "category": "Development",
    "description": "Development skill from everything-claude-code",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "changelog-automation",
    "category": "Automation",
    "description": "Automate changelog generation from commits, PRs, and releases following Keep a Changelog format. Use when setting up release workflows, generating release notes, or standardizing commit conventions.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "cicd-automation-workflow-automate",
    "category": "Frontend",
    "description": "\"You are a workflow automation expert specializing in creating efficient CI/CD pipelines, GitHub Actions workflows, and automated development processes. Design automation that reduces manual work, improves consistency, and accelerates delivery while maintaining quality and security.\"",
    "tags": [
      "UI",
      "Security",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "circleci-automation",
    "category": "Automation",
    "description": "\"Automate CircleCI tasks via Rube MCP (Composio): trigger pipelines, monitor workflows/jobs, retrieve artifacts and test metadata. Always search tools first for current schemas.\"",
    "tags": [
      "Automation",
      "Testing"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "clarity-gate",
    "category": "Automation",
    "description": "\"Pre-ingestion verification for epistemic quality in RAG systems with 9-point verification and Two-Round HITL workflow\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "claude-ally-health",
    "category": "Frontend",
    "description": "\"A health assistant skill for medical information analysis, symptom tracking, and wellness guidance.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Claude Code Guide",
    "category": "Frontend",
    "description": "Master guide for using Claude Code effectively. Includes configuration templates, prompting strategies \"Thinking\" keywords, debugging techniques, and best practices for interacting with the agent.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "d3-viz",
    "category": "Frontend",
    "description": "Creating interactive data visualisations using d3.js. This skill should be used when creating custom charts, graphs, network diagrams, geographic visualisations, or any complex SVG-based data visualisation that requires fine-grained control over visual elements, transitions, or interactions. Use this for bespoke visualisations beyond standard charting libraries, whether in React, Vue, Svelte, vanilla JavaScript, or any other environment.",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "claude-scientific-skills",
    "category": "Development",
    "description": "\"Scientific research and analysis skills\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "claude-speed-reader",
    "category": "Development",
    "description": "\"-Speed read Claude's responses at 600+ WPM using RSVP with Spritz-style ORP highlighting\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "claude-win11-speckit-update-skill",
    "category": "Development",
    "description": "\"Windows 11 system management\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "clean-code",
    "category": "Frontend",
    "description": "\"Applies principles from Robert C. Martin's 'Clean Code'. Use this skill when writing, reviewing, or refactoring code to ensure high quality, readability, and maintainability. Covers naming, functions, comments, error handling, and class design.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "clerk-auth",
    "category": "Security",
    "description": "\"Expert patterns for Clerk auth implementation, middleware, organizations, webhooks, and user sync Use when: adding authentication, clerk auth, user authentication, sign in, sign up.\"",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "clickup-automation",
    "category": "Automation",
    "description": "\"Automate ClickUp project management including tasks, spaces, folders, lists, comments, and team operations via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "close-automation",
    "category": "Automation",
    "description": "\"Automate Close CRM tasks via Rube MCP (Composio): create leads, manage calls/SMS, handle tasks, and track notes. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "cloud-architect",
    "category": "DevOps",
    "description": "Expert cloud architect specializing in AWS/Azure/GCP multi-cloud",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "Cloud Penetration Testing",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"perform cloud penetration testing\", \"assess Azure or AWS or GCP security\", \"enumerate cloud resources\", \"exploit cloud misconfigurations\", \"test O365 security\", \"extract secrets from cloud environments\", or \"audit cloud infrastructure\". It provides comprehensive techniques for security assessment across major cloud platforms.",
    "tags": [
      "Security",
      "Testing",
      "Cloud"
    ],
    "categorySlug": "security"
  },
  {
    "name": "coda-automation",
    "category": "Automation",
    "description": "\"Automate Coda tasks via Rube MCP (Composio): manage docs, pages, tables, rows, formulas, permissions, and publishing. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "code-documentation-code-explain",
    "category": "AI & Agents",
    "description": "\"You are a code education expert specializing in explaining complex code through clear narratives, visual diagrams, and step-by-step breakdowns. Transform difficult concepts into understandable explanations.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "code-documentation-doc-generate",
    "category": "Frontend",
    "description": "\"You are a documentation expert specializing in creating comprehensive, maintainable documentation from code. Generate API docs, architecture diagrams, user guides, and technical references using AI-powered analysis and industry best practices.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "code-refactoring-context-restore",
    "category": "Development",
    "description": "\"Use when working with code refactoring context restore\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "code-refactoring-refactor-clean",
    "category": "Frontend",
    "description": "\"You are a code refactoring expert specializing in clean code principles, SOLID design patterns, and modern software engineering best practices. Analyze and refactor the provided code to improve its quality, maintainability, and performance.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "code-refactoring-tech-debt",
    "category": "Development",
    "description": "\"You are a technical debt expert specializing in identifying, quantifying, and prioritizing technical debt in software projects. Analyze the codebase to uncover debt, assess its impact, and create acti\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "code-review-ai-ai-review",
    "category": "AI & Agents",
    "description": "\"You are an expert AI-powered code review specialist combining automated static analysis, intelligent pattern recognition, and modern DevOps practices. Leverage AI tools (GitHub Copilot, Qodo, GPT-5, C\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "code-review-checklist",
    "category": "AI & Agents",
    "description": "\"Comprehensive checklist for conducting thorough code reviews covering functionality, security, performance, and maintainability\"",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "code-review-excellence",
    "category": "AI & Agents",
    "description": "Master effective code review practices to provide constructive feedback, catch bugs early, and foster knowledge sharing while maintaining team morale. Use when reviewing pull requests, establishing review standards, or mentoring developers.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "code-reviewer",
    "category": "AI & Agents",
    "description": "Elite code review expert specializing in modern AI-powered code",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "codebase-cleanup-deps-audit",
    "category": "AI & Agents",
    "description": "\"You are a dependency security expert specializing in vulnerability scanning, license compliance, and supply chain security. Analyze project dependencies for known vulnerabilities, licensing issues, outdated packages, and provide actionable remediation strategies.\"",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "codebase-cleanup-refactor-clean",
    "category": "Frontend",
    "description": "\"You are a code refactoring expert specializing in clean code principles, SOLID design patterns, and modern software engineering best practices. Analyze and refactor the provided code to improve its quality, maintainability, and performance.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "codebase-cleanup-tech-debt",
    "category": "Development",
    "description": "\"You are a technical debt expert specializing in identifying, quantifying, and prioritizing technical debt in software projects. Analyze the codebase to uncover debt, assess its impact, and create acti\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "codex-review",
    "category": "AI & Agents",
    "description": "Professional code review with auto CHANGELOG generation, integrated with Codex AI",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "commit",
    "category": "Development",
    "description": "\"Create commit messages following Sentry conventions. Use when committing code changes, writing commit messages, or formatting git history. Follows conventional commits with Sentry-specific issue references.\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "competitive-landscape",
    "category": "Development",
    "description": "This skill should be used when the user asks to \"analyze",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "competitor-alternatives",
    "category": "Marketing",
    "description": "\"When the user wants to create competitor comparison or alternative pages for SEO and sales enablement. Also use when the user mentions 'alternative page,' 'vs page,' 'competitor comparison,' 'comparison page,' '[Product] vs [Product],' '[Product] alternative,' or 'competitive landing pages.' Covers four formats: singular alternative, plural alternatives, you vs competitor, and competitor vs competitor. Emphasizes deep research, modular content architecture, and varied section types beyond feature tables.\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "comprehensive-review-full-review",
    "category": "Development",
    "description": "\"Use when working with comprehensive review full review\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "comprehensive-review-pr-enhance",
    "category": "Automation",
    "description": "\"You are a PR optimization expert specializing in creating high-quality pull requests that facilitate efficient code reviews. Generate comprehensive PR descriptions, automate review processes, and ensure PRs follow best practices for clarity, size, and reviewability.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "computer-use-agents",
    "category": "Frontend",
    "description": "\"Build AI agents that interact with computers like humans do - viewing screens, moving cursors, clicking buttons, and typing text. Covers Anthropic's Computer Use, OpenAI's Operator/CUA, and open-source alternatives. Critical focus on sandboxing, security, and handling the unique challenges of vision-based control. Use when: computer use, desktop automation agent, screen control AI, vision-based agent, GUI automation.\"",
    "tags": [
      "UI",
      "Security",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "computer-vision-expert",
    "category": "Development",
    "description": "SOTA Computer Vision Expert (2026). Specialized in YOLO26, Segment Anything 3 (SAM 3), Vision Language Models, and real-time spatial analysis.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "concise-planning",
    "category": "Development",
    "description": "Use when a user asks for a plan for a coding task, to generate a clear, actionable, and atomic checklist.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-implement",
    "category": "Automation",
    "description": "Execute tasks from a track's implementation plan following TDD workflow",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "conductor-manage",
    "category": "Development",
    "description": "\"Manage track lifecycle: archive, restore, delete, rename, and cleanup\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-new-track",
    "category": "Development",
    "description": "Create a new track with specification and phased implementation plan",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-revert",
    "category": "Development",
    "description": "Git-aware undo by logical work unit (track, phase, or task)",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-setup",
    "category": "Development",
    "description": "Initialize project with Conductor artifacts (product definition,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-status",
    "category": "Development",
    "description": "Display project status, active tracks, and next actions",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "conductor-validator",
    "category": "Development",
    "description": "Validates Conductor project artifacts for completeness,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "confluence-automation",
    "category": "Automation",
    "description": "\"Automate Confluence page creation, content search, space management, labels, and hierarchy navigation via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "content-creator",
    "category": "Marketing",
    "description": "Create SEO-optimized marketing content with consistent brand voice. Includes brand voice analyzer, SEO optimizer, content frameworks, and social media templates. Use when writing blog posts, creating social media content, analyzing brand voice, optimizing SEO, planning content calendars, or when user mentions content creation, brand voice, SEO optimization, social media marketing, or content strategy.",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "content-marketer",
    "category": "AI & Agents",
    "description": "Elite content marketing strategist specializing in AI-powered",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "context-compression",
    "category": "Frontend",
    "description": "\"Design and evaluate compression strategies for long-running sessions\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "context-degradation",
    "category": "AI & Agents",
    "description": "\"Recognize patterns of context failure: lost-in-middle, poisoning, distraction, and clash\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "context-driven-development",
    "category": "Development",
    "description": "Use this skill when working with Conductor's context-driven",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "context-fundamentals",
    "category": "AI & Agents",
    "description": "\"Understand what context is, why it matters, and the anatomy of context in agent systems\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "context-management-context-restore",
    "category": "Development",
    "description": "\"Use when working with context management context restore\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "context-management-context-save",
    "category": "Development",
    "description": "\"Use when working with context management context save\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "context-manager",
    "category": "AI & Agents",
    "description": "Elite AI context engineering specialist mastering dynamic context",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "context-optimization",
    "category": "Development",
    "description": "\"Apply compaction, masking, and caching strategies\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "context-window-management",
    "category": "AI & Agents",
    "description": "\"Strategies for managing LLM context windows including summarization, trimming, routing, and avoiding context rot Use when: context window, token limit, context management, context engineering, long context.\"",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "context7-auto-research",
    "category": "Backend",
    "description": "Automatically fetch latest library/framework documentation for Claude Code via Context7 API",
    "tags": [
      "API",
      "Automation",
      "Testing"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "conversation-memory",
    "category": "AI & Agents",
    "description": "\"Persistent memory systems for LLM conversations including short-term, long-term, and entity-based memory Use when: conversation memory, remember, memory persistence, long-term memory, chat history.\"",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "convertkit-automation",
    "category": "Automation",
    "description": "\"Automate ConvertKit (Kit) tasks via Rube MCP (Composio): manage subscribers, tags, broadcasts, and broadcast stats. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "copy-editing",
    "category": "Marketing",
    "description": "\"When the user wants to edit, review, or improve existing marketing copy. Also use when the user mentions 'edit this copy,' 'review my copy,' 'copy feedback,' 'proofread,' 'polish this,' 'make this better,' or 'copy sweep.' This skill provides a systematic approach to editing marketing copy through multiple focused passes.\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "copywriting",
    "category": "Marketing",
    "description": ">",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "core-components",
    "category": "Frontend",
    "description": "Core component library and design system patterns. Use when building UI, using design tokens, or working with the component library.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "cost-optimization",
    "category": "DevOps",
    "description": "Optimize cloud costs through resource rightsizing, tagging strategies, reserved instances, and spending analysis. Use when reducing cloud expenses, analyzing infrastructure costs, or implementing cost governance policies.",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "cpp-pro",
    "category": "AI & Agents",
    "description": "Write idiomatic C++ code with modern features, RAII, smart",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "cqrs-implementation",
    "category": "Frontend",
    "description": "Implement Command Query Responsibility Segregation for scalable architectures. Use when separating read and write models, optimizing query performance, or building event-sourced systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "create-pr",
    "category": "Frontend",
    "description": "\"Create pull requests following Sentry conventions. Use when opening PRs, writing PR descriptions, or preparing changes for review. Follows Sentry's code review guidelines.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "crewai",
    "category": "Frontend",
    "description": "\"Expert in CrewAI - the leading role-based multi-agent framework used by 60% of Fortune 500 companies. Covers agent design with roles and goals, task definition, crew orchestration, process types (sequential, hierarchical, parallel), memory systems, and flows for complex workflows. Essential for building collaborative AI agent teams. Use when: crewai, multi-agent team, agent roles, crew of agents, role-based agents.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "csharp-pro",
    "category": "Development",
    "description": "Write modern C# code with advanced features like records, pattern",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "culture-index",
    "category": "Development",
    "description": "\"Index and search culture documentation\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "customer-support",
    "category": "AI & Agents",
    "description": "Elite AI-powered customer support specialist mastering",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "daily-news-report",
    "category": "AI & Agents",
    "description": "Scrapes content based on a preset URL list, filters high-quality technical information, and generates daily Markdown reports.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "data-engineer",
    "category": "Frontend",
    "description": "Build scalable data pipelines, modern data warehouses, and",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "data-engineering-data-driven-feature",
    "category": "Frontend",
    "description": "\"Build features guided by data insights, A/B testing, and continuous measurement using specialized agents for analysis, implementation, and experimentation.\"",
    "tags": [
      "UI",
      "AI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "data-engineering-data-pipeline",
    "category": "Automation",
    "description": "\"You are a data pipeline architecture expert specializing in scalable, reliable, and cost-effective data pipelines for batch and streaming data processing.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "data-quality-frameworks",
    "category": "Frontend",
    "description": "Implement data quality validation with Great Expectations, dbt tests, and data contracts. Use when building data quality pipelines, implementing validation rules, or establishing data contracts.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "data-scientist",
    "category": "Data & Analytics",
    "description": "Expert data scientist for advanced analytics, machine learning, and",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "data-storytelling",
    "category": "Frontend",
    "description": "Transform data into compelling narratives using visualization, context, and persuasive structure. Use when presenting analytics to stakeholders, creating data reports, or building executive presentations.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "database-admin",
    "category": "Backend",
    "description": "Expert database administrator specializing in modern cloud",
    "tags": [
      "Database",
      "Cloud"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "database-architect",
    "category": "Frontend",
    "description": "Expert database architect specializing in data layer design from",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "database-cloud-optimization-cost-optimize",
    "category": "Backend",
    "description": "\"You are a cloud cost optimization expert specializing in reducing infrastructure expenses while maintaining performance and reliability. Analyze cloud spending, identify savings opportunities, and implement cost-effective architectures across AWS, Azure, and GCP.\"",
    "tags": [
      "AI",
      "Cloud"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "database-design",
    "category": "Frontend",
    "description": "Database design principles and decision-making. Schema design, indexing strategy, ORM selection, serverless databases.",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "database-migration",
    "category": "Backend",
    "description": "Execute database migrations across ORMs and platforms with zero-downtime strategies, data transformation, and rollback procedures. Use when migrating databases, changing schemas, performing data transformations, or implementing zero-downtime deployment strategies.",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "database-migrations-migration-observability",
    "category": "Backend",
    "description": "Migration monitoring, CDC, and observability infrastructure",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "database-migrations-sql-migrations",
    "category": "Backend",
    "description": "SQL database migrations with zero-downtime strategies for",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "database-optimizer",
    "category": "Backend",
    "description": "Expert database optimizer specializing in modern performance",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "datadog-automation",
    "category": "Automation",
    "description": "\"Automate Datadog tasks via Rube MCP (Composio): query metrics, search logs, manage monitors/dashboards, create events and downtimes. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "dbt-transformation-patterns",
    "category": "Frontend",
    "description": "Master dbt (data build tool) for analytics engineering with model organization, testing, documentation, and incremental strategies. Use when building data transformations, creating data models, or implementing analytics engineering best practices.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "debugger",
    "category": "AI & Agents",
    "description": "Debugging specialist for errors, test failures, and unexpected",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "debugging-strategies",
    "category": "Development",
    "description": "Master systematic debugging techniques, profiling tools, and root cause analysis to efficiently track down bugs across any codebase or technology stack. Use when investigating bugs, performance issues, or unexpected behavior.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "debugging-toolkit-smart-debug",
    "category": "Development",
    "description": "\"Use when working with debugging toolkit smart debug\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "deep-research",
    "category": "Backend",
    "description": "\"Execute autonomous multi-step research using Google Gemini Deep Research Agent. Use for: market analysis, competitive landscaping, literature reviews, technical research, due diligence. Takes 2-10 minutes but produces detailed, cited reports. Costs $2-5 per task.\"",
    "tags": [
      "API",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "defi-protocol-templates",
    "category": "Frontend",
    "description": "Implement DeFi protocols with production-ready templates for staking, AMMs, governance, and lending systems. Use when building decentralized finance applications or smart contract protocols.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "dependency-management-deps-audit",
    "category": "AI & Agents",
    "description": "\"You are a dependency security expert specializing in vulnerability scanning, license compliance, and supply chain security. Analyze project dependencies for known vulnerabilities, licensing issues, outdated packages, and provide actionable remediation strategies.\"",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "dependency-upgrade",
    "category": "Testing",
    "description": "Manage major dependency version upgrades with compatibility analysis, staged rollout, and comprehensive testing. Use when upgrading framework versions, updating major dependencies, or managing breaking changes in libraries.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "deployment-engineer",
    "category": "Automation",
    "description": "Expert deployment engineer specializing in modern CI/CD pipelines,",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "deployment-pipeline-design",
    "category": "Frontend",
    "description": "Design multi-stage CI/CD pipelines with approval gates, security checks, and deployment orchestration. Use when architecting deployment workflows, setting up continuous delivery, or implementing GitOps practices.",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "deployment-procedures",
    "category": "Automation",
    "description": "Production deployment principles and decision-making. Safe deployment workflows, rollback strategies, and verification. Teaches thinking, not scripts.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "deployment-validation-config-validate",
    "category": "Automation",
    "description": "\"You are a configuration management expert specializing in validating, testing, and ensuring the correctness of application configurations. Create comprehensive validation schemas, implement configurat\"",
    "tags": [
      "Testing"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "design-md",
    "category": "Frontend",
    "description": "\"Analyze Stitch projects and synthesize a semantic design system into DESIGN.md files\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "design-orchestration",
    "category": "Frontend",
    "description": ">",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "devops-troubleshooter",
    "category": "Backend",
    "description": "Expert DevOps troubleshooter specializing in rapid incident",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "discord-automation",
    "category": "Frontend",
    "description": "\"Automate Discord tasks via Rube MCP (Composio): messages, channels, roles, webhooks, reactions. Always search tools first for current schemas.\"",
    "tags": [
      "React",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "discord-bot-architect",
    "category": "Frontend",
    "description": "\"Specialized skill for building production-ready Discord bots. Covers Discord.js (JavaScript) and Pycord (Python), gateway intents, slash commands, interactive components, rate limiting, and sharding.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "dispatching-parallel-agents",
    "category": "AI & Agents",
    "description": "Use when facing 2+ independent tasks that can be worked on without shared state or sequential dependencies",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "distributed-debugging-debug-trace",
    "category": "Automation",
    "description": "\"You are a debugging expert specializing in setting up comprehensive debugging environments, distributed tracing, and diagnostic tools. Configure debugging workflows, implement tracing solutions, and establish troubleshooting practices for development and production environments.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "distributed-tracing",
    "category": "Development",
    "description": "Implement distributed tracing with Jaeger and Tempo to track requests across microservices and identify performance bottlenecks. Use when debugging microservices, analyzing request flows, or implementing observability for distributed systems.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "django-pro",
    "category": "Development",
    "description": "Master Django 5.x with async views, DRF, Celery, and Django",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "doc-coauthoring",
    "category": "Frontend",
    "description": "Guide users through a structured workflow for co-authoring documentation. Use when user wants to write documentation, proposals, technical specs, decision docs, or similar structured content. This workflow helps users efficiently transfer context, refine content through iteration, and verify the doc works for readers. Trigger when user mentions writing docs, creating proposals, drafting specs, or similar documentation tasks.",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "docker-expert",
    "category": "Frontend",
    "description": "Docker containerization expert with deep knowledge of multi-stage builds, image optimization, container security, Docker Compose orchestration, and production deployment patterns. Use PROACTIVELY for Dockerfile optimization, container issues, image size problems, security hardening, networking, and orchestration challenges.",
    "tags": [
      "UI",
      "Security",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "docs-architect",
    "category": "Development",
    "description": "Creates comprehensive technical documentation from existing",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "documentation-generation-doc-generate",
    "category": "Frontend",
    "description": "\"You are a documentation expert specializing in creating comprehensive, maintainable documentation from code. Generate API docs, architecture diagrams, user guides, and technical references using AI-powered analysis and industry best practices.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "documentation-templates",
    "category": "Frontend",
    "description": "Documentation templates and structure guidelines. README, API docs, code comments, and AI-friendly documentation.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "docusign-automation",
    "category": "Automation",
    "description": "\"Automate DocuSign tasks via Rube MCP (Composio): templates, envelopes, signatures, document management. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "docx",
    "category": "Marketing",
    "description": "\"Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "dotnet-architect",
    "category": "Backend",
    "description": "Expert .NET backend architect specializing in C#, ASP.NET Core,",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "dotnet-backend",
    "category": "Frontend",
    "description": "Build ASP.NET Core 8+ backend services with EF Core, auth, background jobs, and production API patterns.",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "dotnet-backend-patterns",
    "category": "Frontend",
    "description": "Master C#/.NET backend development patterns for building robust APIs, MCP servers, and enterprise applications. Covers async/await, dependency injection, Entity Framework Core, Dapper, configuration, caching, and testing with xUnit. Use when developing .NET backends, reviewing C# code, or designing API architectures.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "dropbox-automation",
    "category": "Automation",
    "description": "\"Automate Dropbox file management, sharing, search, uploads, downloads, and folder operations via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "dx-optimizer",
    "category": "Development",
    "description": "Developer Experience specialist. Improves tooling, setup, and",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "e2e-testing-patterns",
    "category": "Frontend",
    "description": "Master end-to-end testing with Playwright and Cypress to build reliable test suites that catch bugs, improve confidence, and enable fast deployment. Use when implementing E2E tests, debugging flaky tests, or establishing testing standards.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "elixir-pro",
    "category": "Development",
    "description": "Write idiomatic Elixir code with OTP patterns, supervision trees,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "email-sequence",
    "category": "AI & Agents",
    "description": "When the user wants to create or optimize an email sequence, drip campaign, automated email flow, or lifecycle email program. Also use when the user mentions \"email sequence,\" \"drip campaign,\" \"nurture sequence,\" \"onboarding emails,\" \"welcome sequence,\" \"re-engagement emails,\" \"email automation,\" or \"lifecycle emails.\" For in-app onboarding, see onboarding-cro.",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "email-systems",
    "category": "AI & Agents",
    "description": "\"Email has the highest ROI of any marketing channel. $36 for every $1 spent. Yet most startups treat it as an afterthought - bulk blasts, no personalization, landing in spam folders.  This skill covers transactional email that works, marketing automation that converts, deliverability that reaches inboxes, and the infrastructure decisions that scale. Use when: keywords, file_patterns, code_patterns.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "embedding-strategies",
    "category": "AI & Agents",
    "description": "Select and optimize embedding models for semantic search and RAG applications. Use when choosing embedding models, implementing chunking strategies, or optimizing embedding quality for specific domains.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "employment-contract-templates",
    "category": "Development",
    "description": "Create employment contracts, offer letters, and HR policy documents following legal best practices. Use when drafting employment agreements, creating HR policies, or standardizing employment documentation.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "environment-setup-guide",
    "category": "Frontend",
    "description": "\"Guide developers through setting up development environments with proper tools, dependencies, and configurations\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "error-debugging-error-analysis",
    "category": "Development",
    "description": "\"You are an expert error analysis specialist with deep expertise in debugging distributed systems, analyzing production incidents, and implementing comprehensive observability solutions.\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "error-debugging-error-trace",
    "category": "Frontend",
    "description": "\"You are an error tracking and observability expert specializing in implementing comprehensive error monitoring solutions. Set up error tracking systems, configure alerts, implement structured logging, and ensure teams can quickly identify and resolve production issues.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "error-debugging-multi-agent-review",
    "category": "AI & Agents",
    "description": "\"Use when working with error debugging multi agent review\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "error-detective",
    "category": "Development",
    "description": "Search logs and codebases for error patterns, stack traces, and",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "error-diagnostics-error-analysis",
    "category": "Development",
    "description": "\"You are an expert error analysis specialist with deep expertise in debugging distributed systems, analyzing production incidents, and implementing comprehensive observability solutions.\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "error-diagnostics-error-trace",
    "category": "Development",
    "description": "\"You are an error tracking and observability expert specializing in implementing comprehensive error monitoring solutions. Set up error tracking systems, configure alerts, implement structured logging,\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "error-diagnostics-smart-debug",
    "category": "Development",
    "description": "\"Use when working with error diagnostics smart debug\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "error-handling-patterns",
    "category": "Frontend",
    "description": "Master error handling patterns across languages including exceptions, Result types, error propagation, and graceful degradation to build resilient applications. Use when implementing error handling, designing APIs, or improving application reliability.",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Ethical Hacking Methodology",
    "category": "AI & Agents",
    "description": "This skill should be used when the user asks to \"learn ethical hacking\", \"understand penetration testing lifecycle\", \"perform reconnaissance\", \"conduct security scanning\", \"exploit vulnerabilities\", or \"write penetration test reports\". It provides comprehensive ethical hacking methodology and techniques.",
    "tags": [
      "Security",
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "evaluation",
    "category": "Frontend",
    "description": "\"Build evaluation frameworks for agent systems\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "event-sourcing-architect",
    "category": "Frontend",
    "description": "\"Expert in event sourcing, CQRS, and event-driven architecture patterns. Masters event store design, projection building, saga orchestration, and eventual consistency patterns. Use PROACTIVELY for event-sourced systems, audit trails, or temporal queries.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "event-store-design",
    "category": "Frontend",
    "description": "Design and implement event stores for event-sourced systems. Use when building event sourcing infrastructure, choosing event store technologies, or implementing event persistence patterns.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "exa-search",
    "category": "Backend",
    "description": "Semantic search, similar content discovery, and structured research using Exa API",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "executing-plans",
    "category": "Development",
    "description": "Use when you have a written implementation plan to execute in a separate session with review checkpoints",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "expo-deployment",
    "category": "Automation",
    "description": "\"Deploy Expo apps to production\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "fal-audio",
    "category": "AI & Agents",
    "description": "\"Text-to-speech and speech-to-text using fal.ai audio models\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "fal-generate",
    "category": "AI & Agents",
    "description": "\"Generate images and videos using fal.ai AI models\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "fal-image-edit",
    "category": "AI & Agents",
    "description": "\"AI-powered image editing with style transfer and object removal\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "fal-platform",
    "category": "Backend",
    "description": "\"Platform APIs for model management, pricing, and usage tracking\"",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "fal-upscale",
    "category": "AI & Agents",
    "description": "\"Upscale and enhance image and video resolution using AI\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "fal-workflow",
    "category": "AI & Agents",
    "description": "\"Generate workflow JSON files for chaining AI models\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "fastapi-pro",
    "category": "Frontend",
    "description": "Build high-performance async APIs with FastAPI, SQLAlchemy 2.0, and",
    "tags": [
      "UI",
      "API",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "fastapi-templates",
    "category": "Frontend",
    "description": "Create production-ready FastAPI projects with async patterns, dependency injection, and comprehensive error handling. Use when building new FastAPI applications or setting up backend API projects.",
    "tags": [
      "UI",
      "API",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ffuf-claude-skill",
    "category": "Development",
    "description": "\"Web fuzzing with ffuf\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "figma-automation",
    "category": "Frontend",
    "description": "\"Automate Figma tasks via Rube MCP (Composio): files, components, design tokens, comments, exports. Always search tools first for current schemas.\"",
    "tags": [
      "UI",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "file-organizer",
    "category": "Development",
    "description": "Intelligently organizes files and folders by understanding context, finding duplicates, and suggesting better organizational structures. Use when user wants to clean up directories, organize downloads, remove duplicates, or restructure projects.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "File Path Traversal Testing",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"test for directory traversal\", \"exploit path traversal vulnerabilities\", \"read arbitrary files through web applications\", \"find LFI vulnerabilities\", or \"access files outside web root\". It provides comprehensive file path traversal attack and testing methodologies.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "file-uploads",
    "category": "DevOps",
    "description": "\"Expert at handling file uploads and cloud storage. Covers S3, Cloudflare R2, presigned URLs, multipart uploads, and image optimization. Knows how to handle large files without blocking. Use when: file upload, S3, R2, presigned URL, multipart.\"",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "find-bugs",
    "category": "Security",
    "description": "\"Find bugs, security vulnerabilities, and code quality issues in local branch changes. Use when asked to review changes, find bugs, security review, or audit code on the current branch.\"",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "finishing-a-development-branch",
    "category": "Frontend",
    "description": "Use when implementation is complete, all tests pass, and you need to decide how to integrate the work - guides completion of development work by presenting structured options for merge, PR, or cleanup",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "firebase",
    "category": "Frontend",
    "description": "\"Firebase gives you a complete backend in minutes - auth, database, storage, functions, hosting. But the ease of setup hides real complexity. Security rules are your last line of defense, and they're often wrong. Firestore queries are limited, and you learn this after you've designed your data model.  This skill covers Firebase Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Storage, and Firebase Hosting. Key insight: Firebase is optimized for read-heavy, denormalized data. I\"",
    "tags": [
      "UI",
      "Security",
      "Backend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "firecrawl-scraper",
    "category": "Backend",
    "description": "Deep web scraping, screenshots, PDF parsing, and website crawling using Firecrawl API",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "firmware-analyst",
    "category": "Development",
    "description": "Expert firmware analyst specializing in embedded systems, IoT",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "fix-review",
    "category": "Development",
    "description": "\"Verify fix commits address audit findings without new bugs\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "flutter-expert",
    "category": "Mobile",
    "description": "Master Flutter development with Dart 3, advanced widgets, and",
    "tags": [
      "Mobile"
    ],
    "categorySlug": "mobile"
  },
  {
    "name": "form-cro",
    "category": "Development",
    "description": ">",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "fp-ts-errors",
    "category": "Development",
    "description": "Handle errors as values using fp-ts Either and TaskEither for cleaner, more predictable TypeScript code. Use when implementing error handling patterns with fp-ts.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "fp-ts-pragmatic",
    "category": "Frontend",
    "description": "A practical, jargon-free guide to fp-ts functional programming - the 80/20 approach that gets results without the academic overhead. Use when writing TypeScript with fp-ts library.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "fp-ts-react",
    "category": "Frontend",
    "description": "Practical patterns for using fp-ts with React - hooks, state, forms, data fetching. Use when building React apps with functional programming patterns. Works with React 18/19, Next.js 14/15.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "framework-migration-code-migrate",
    "category": "Automation",
    "description": "\"You are a code migration expert specializing in transitioning codebases between frameworks, languages, versions, and platforms. Generate comprehensive migration plans, automated migration scripts, and\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "framework-migration-deps-upgrade",
    "category": "Testing",
    "description": "\"You are a dependency management expert specializing in safe, incremental upgrades of project dependencies. Plan and execute dependency updates with minimal risk, proper testing, and clear migration pa\"",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "framework-migration-legacy-modernize",
    "category": "AI & Agents",
    "description": "\"Orchestrate a comprehensive legacy system modernization using the strangler fig pattern, enabling gradual replacement of outdated components while maintaining continuous business operations through ex\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "free-tool-strategy",
    "category": "Frontend",
    "description": "When the user wants to plan, evaluate, or build a free tool for marketing purposes — lead generation, SEO value, or brand awareness. Also use when the user mentions \"engineering as marketing,\" \"free tool,\" \"marketing tool,\" \"calculator,\" \"generator,\" \"interactive tool,\" \"lead gen tool,\" \"build a tool for leads,\" or \"free resource.\" This skill bridges engineering and marketing — useful for founders and technical marketers.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "freshdesk-automation",
    "category": "Automation",
    "description": "\"Automate Freshdesk helpdesk operations including tickets, contacts, companies, notes, and replies via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "freshservice-automation",
    "category": "AI & Agents",
    "description": "\"Automate Freshservice ITSM tasks via Rube MCP (Composio): create/update tickets, bulk operations, service requests, and outbound emails. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "frontend-design",
    "category": "Frontend",
    "description": "Create distinctive, production-grade frontend interfaces with intentional aesthetics, high craft, and non-generic visual identity. Use when building or styling web UIs, components, pages, dashboards, or frontend applications.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-dev-guidelines",
    "category": "Frontend",
    "description": "Opinionated frontend development standards for modern React + TypeScript applications. Covers Suspense-first data fetching, lazy loading, feature-based architecture, MUI v7 styling, TanStack Router, performance optimization, and strict TypeScript practices.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-developer",
    "category": "Frontend",
    "description": "Build React components, implement responsive layouts, and handle",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-mobile-development-component-scaffold",
    "category": "Frontend",
    "description": "\"You are a React component architecture expert specializing in scaffolding production-ready, accessible, and performant components. Generate complete component implementations with TypeScript, tests, s\"",
    "tags": [
      "React",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-mobile-security-xss-scan",
    "category": "Frontend",
    "description": "\"You are a frontend security specialist focusing on Cross-Site Scripting (XSS) vulnerability detection and prevention. Analyze React, Vue, Angular, and vanilla JavaScript code to identify injection poi\"",
    "tags": [
      "UI",
      "React",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-security-coder",
    "category": "Frontend",
    "description": "Expert in secure frontend coding practices specializing in XSS",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "frontend-slides",
    "category": "Frontend",
    "description": "Create stunning, animation-rich HTML presentations from scratch or by converting PowerPoint files. Use when the user wants to build a presentation, convert a PPT/PPTX to web, or create slides for a talk/pitch. Helps non-designers discover their aesthetic through visual exploration rather than abstract choices.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "full-stack-orchestration-full-stack-feature",
    "category": "Development",
    "description": "\"Use when working with full stack orchestration full stack feature\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "game-development",
    "category": "Development",
    "description": "Game development orchestrator. Routes to platform-specific skills based on project needs.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "gcp-cloud-run",
    "category": "Frontend",
    "description": "\"Specialized skill for building production-ready serverless applications on GCP. Covers Cloud Run services (containerized), Cloud Run Functions (event-driven), cold start optimization, and event-driven architecture with Pub/Sub.\"",
    "tags": [
      "UI",
      "AI",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "gdpr-data-handling",
    "category": "Frontend",
    "description": "Implement GDPR-compliant data handling with consent management, data subject rights, and privacy by design. Use when building systems that process EU personal data, implementing privacy controls, or conducting GDPR compliance reviews.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "geo-fundamentals",
    "category": "AI & Agents",
    "description": "Generative Engine Optimization for AI search engines (ChatGPT, Claude, Perplexity).",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "git-advanced-workflows",
    "category": "AI & Agents",
    "description": "Master advanced Git workflows including rebasing, cherry-picking, bisect, worktrees, and reflog to maintain clean history and recover from any situation. Use when managing complex Git histories, collaborating on feature branches, or troubleshooting repository issues.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "git-pr-workflows-git-workflow",
    "category": "AI & Agents",
    "description": "\"Orchestrate a comprehensive git workflow from code review through PR creation, leveraging specialized agents for quality assurance, testing, and deployment readiness. This workflow implements modern g\"",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "git-pr-workflows-onboard",
    "category": "Automation",
    "description": "\"You are an **expert onboarding specialist and knowledge transfer architect** with deep experience in remote-first organizations, technical team integration, and accelerated learning methodologies. You\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "git-pr-workflows-pr-enhance",
    "category": "Automation",
    "description": "\"You are a PR optimization expert specializing in creating high-quality pull requests that facilitate efficient code reviews. Generate comprehensive PR descriptions, automate review processes, and ensu\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "git-pushing",
    "category": "Automation",
    "description": "Stage, commit, and push git changes with conventional commit messages. Use when user wants to commit and push changes, mentions pushing to remote, or asks to save and push their work. Also activates when user says \"push changes\", \"commit and push\", \"push this\", \"push to github\", or similar git workflow requests.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "github-actions-templates",
    "category": "Frontend",
    "description": "Create production-ready GitHub Actions workflows for automated testing, building, and deploying applications. Use when setting up CI/CD with GitHub Actions, automating development workflows, or creating reusable workflow templates.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "github-automation",
    "category": "Automation",
    "description": "\"Automate GitHub repositories, issues, pull requests, branches, CI/CD, and permissions via Rube MCP (Composio). Manage code workflows, review PRs, search code, and handle deployments programmatically.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "github-workflow-automation",
    "category": "AI & Agents",
    "description": "\"Automate GitHub workflows with AI assistance. Includes PR reviews, issue triage, CI/CD integration, and Git operations. Use when automating GitHub workflows, setting up PR review automation, creating GitHub Actions, or triaging issues.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "gitlab-automation",
    "category": "Automation",
    "description": "\"Automate GitLab project management, issues, merge requests, pipelines, branches, and user operations via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "gitlab-ci-patterns",
    "category": "Frontend",
    "description": "Build GitLab CI/CD pipelines with multi-stage workflows, caching, and distributed runners for scalable automation. Use when implementing GitLab CI/CD, optimizing pipeline performance, or setting up automated testing and deployment.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "gitops-workflow",
    "category": "Frontend",
    "description": "Implement GitOps workflows with ArgoCD and Flux for automated, declarative Kubernetes deployments with continuous reconciliation. Use when implementing GitOps practices, automating Kubernetes deployments, or setting up declarative infrastructure management.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "gmail-automation",
    "category": "AI & Agents",
    "description": "\"Automate Gmail tasks via Rube MCP (Composio): send/reply, search, labels, drafts, attachments. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "go-concurrency-patterns",
    "category": "Frontend",
    "description": "Master Go concurrency with goroutines, channels, sync primitives, and context. Use when building concurrent Go applications, implementing worker pools, or debugging race conditions.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "godot-gdscript-patterns",
    "category": "Frontend",
    "description": "Master Godot 4 GDScript patterns including signals, scenes, state machines, and optimization. Use when building Godot games, implementing game systems, or learning GDScript best practices.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "golang-pro",
    "category": "Development",
    "description": "Master Go 1.21+ with modern patterns, advanced concurrency,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "google-analytics-automation",
    "category": "Automation",
    "description": "\"Automate Google Analytics tasks via Rube MCP (Composio): run reports, list accounts/properties, funnels, pivots, key events. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "google-calendar-automation",
    "category": "AI & Agents",
    "description": "\"Automate Google Calendar events, scheduling, availability checks, and attendee management via Rube MCP (Composio). Create events, find free slots, manage attendees, and list calendars programmatically.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "google-drive-automation",
    "category": "Automation",
    "description": "\"Automate Google Drive file operations (upload, download, search, share, organize) via Rube MCP (Composio). Upload/download files, manage folders, share with permissions, and search across drives programmatically.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "googlesheets-automation",
    "category": "Automation",
    "description": "\"Automate Google Sheets operations (read, write, format, filter, manage spreadsheets) via Rube MCP (Composio). Read/write data, manage tabs, apply formatting, and search rows programmatically.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "grafana-dashboards",
    "category": "Frontend",
    "description": "Create and manage production Grafana dashboards for real-time visualization of system and application metrics. Use when building monitoring dashboards, visualizing metrics, or creating operational observability interfaces.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "graphql",
    "category": "Frontend",
    "description": "\"GraphQL gives clients exactly the data they need - no more, no less. One endpoint, typed schema, introspection. But the flexibility that makes it powerful also makes it dangerous. Without proper controls, clients can craft queries that bring down your server.  This skill covers schema design, resolvers, DataLoader for N+1 prevention, federation for microservices, and client integration with Apollo/urql. Key insight: GraphQL is a contract. The schema is the API documentation. Design it carefully.\"",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "graphql-architect",
    "category": "Development",
    "description": "Master modern GraphQL with federation, performance optimization,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "haskell-pro",
    "category": "Development",
    "description": "Expert Haskell engineer specializing in advanced type systems, pure",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "helm-chart-scaffolding",
    "category": "Frontend",
    "description": "Design, organize, and manage Helm charts for templating and packaging Kubernetes applications with reusable configurations. Use when creating Helm charts, packaging Kubernetes applications, or implementing templated deployments.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "helpdesk-automation",
    "category": "Automation",
    "description": "\"Automate HelpDesk tasks via Rube MCP (Composio): list tickets, manage views, use canned responses, and configure custom fields. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "hr-pro",
    "category": "Development",
    "description": "Professional, ethical HR partner for hiring,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "HTML Injection Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"test for HTML injection\", \"inject HTML into web pages\", \"perform HTML injection attacks\", \"deface web applications\", or \"test content injection vulnerabilities\". It provides comprehensive HTML injection attack techniques and testing methodologies.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "hubspot-automation",
    "category": "Automation",
    "description": "\"Automate HubSpot CRM operations (contacts, companies, deals, tickets, properties) via Rube MCP using Composio integration.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "hubspot-integration",
    "category": "Backend",
    "description": "\"Expert patterns for HubSpot CRM integration including OAuth authentication, CRM objects, associations, batch operations, webhooks, and custom objects. Covers Node.js and Python SDKs. Use when: hubspot, hubspot api, hubspot crm, hubspot integration, contacts api.\"",
    "tags": [
      "API",
      "Security"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "hugging-face-cli",
    "category": "Backend",
    "description": "\"Execute Hugging Face Hub operations using the `hf` CLI. Use when the user needs to download models/datasets/spaces, upload files to Hub repositories, create repos, manage local cache, or run compute jobs on HF infrastructure. Covers authentication, file transfers, repository creation, cache operations, and cloud compute.\"",
    "tags": [
      "Security",
      "Cloud"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "hugging-face-jobs",
    "category": "Frontend",
    "description": "\"This skill should be used when users want to run any workload on Hugging Face Jobs infrastructure. Covers UV scripts, Docker-based jobs, hardware selection, cost estimation, authentication with tokens, secrets management, timeout configuration, and result persistence. Designed for general-purpose compute workloads including data processing, inference, experiments, batch jobs, and any Python-based tasks. Should be invoked for tasks involving cloud compute, GPU workloads, or when users mention running jobs on Hugging Face infrastructure without local setup.\"",
    "tags": [
      "UI",
      "Security",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "hybrid-cloud-architect",
    "category": "DevOps",
    "description": "Expert hybrid cloud architect specializing in complex multi-cloud",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "hybrid-cloud-networking",
    "category": "Frontend",
    "description": "Configure secure, high-performance connectivity between on-premises infrastructure and cloud platforms using VPN and dedicated connections. Use when building hybrid cloud architectures, connecting data centers to cloud, or implementing secure cross-premises networking.",
    "tags": [
      "UI",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "hybrid-search-implementation",
    "category": "Frontend",
    "description": "Combine vector and keyword search for improved retrieval. Use when implementing RAG systems, building search engines, or when neither approach alone provides sufficient recall.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "i18n-localization",
    "category": "Development",
    "description": "Internationalization and localization patterns. Detecting hardcoded strings, managing translations, locale files, RTL support.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "IDOR Vulnerability Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"test for insecure direct object references,\" \"find IDOR vulnerabilities,\" \"exploit broken access control,\" \"enumerate user IDs or object references,\" or \"bypass authorization to access other users' data.\" It provides comprehensive guidance for detecting, exploiting, and remediating IDOR vulnerabilities in web applications.",
    "tags": [
      "UI",
      "Security",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "imagen",
    "category": "Development",
    "description": "|",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "incident-responder",
    "category": "Backend",
    "description": "Expert SRE incident responder specializing in rapid problem",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "incident-response-incident-response",
    "category": "Development",
    "description": "\"Use when working with incident response incident response\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "incident-response-smart-fix",
    "category": "AI & Agents",
    "description": "\"[Extended thinking: This workflow implements a sophisticated debugging and resolution pipeline that leverages AI-assisted debugging tools and observability platforms to systematically diagnose and res\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "incident-runbook-templates",
    "category": "Frontend",
    "description": "Create structured incident response runbooks with step-by-step procedures, escalation paths, and recovery actions. Use when building runbooks, responding to incidents, or establishing incident response procedures.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Infinite Gratitude",
    "category": "AI & Agents",
    "description": "Multi-agent research skill for parallel research execution (10 agents, battle-tested with real case studies).",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "inngest",
    "category": "Backend",
    "description": "\"Inngest expert for serverless-first background jobs, event-driven workflows, and durable execution without managing queues or workers. Use when: inngest, serverless background job, event-driven workflow, step function, durable execution.\"",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "instagram-automation",
    "category": "Automation",
    "description": "\"Automate Instagram tasks via Rube MCP (Composio): create posts, carousels, manage media, get insights, and publishing limits. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "interactive-portfolio",
    "category": "Frontend",
    "description": "\"Expert in building portfolios that actually land jobs and clients - not just showing work, but creating memorable experiences. Covers developer portfolios, designer portfolios, creative portfolios, and portfolios that convert visitors into opportunities. Use when: portfolio, personal website, showcase work, developer portfolio, designer portfolio.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "intercom-automation",
    "category": "Automation",
    "description": "\"Automate Intercom tasks via Rube MCP (Composio): conversations, contacts, companies, segments, admins. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "internal-comms",
    "category": "Development",
    "description": "A set of resources to help me write all kinds of internal communications, using the formats that my company likes to use. Claude should use this skill whenever asked to write some sort of internal communications (status reports, leadership updates, 3P updates, company newsletters, FAQs, incident reports, project updates, etc.).",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "internal-comms",
    "category": "Development",
    "description": "A set of resources to help me write all kinds of internal communications, using the formats that my company likes to use. Claude should use this skill whenever asked to write some sort of internal communications (status reports, leadership updates, 3P updates, company newsletters, FAQs, incident reports, project updates, etc.).",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "ios-developer",
    "category": "Frontend",
    "description": "Develop native iOS applications with Swift/SwiftUI. Masters iOS 18,",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "istio-traffic-management",
    "category": "Frontend",
    "description": "Configure Istio traffic management including routing, load balancing, circuit breakers, and canary deployments. Use when implementing service mesh traffic policies, progressive delivery, or resilience patterns.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "iterate-pr",
    "category": "AI & Agents",
    "description": "\"Iterate on a PR until CI passes. Use when you need to fix CI failures, address review feedback, or continuously push fixes until all checks are green. Automates the feedback-fix-push-wait cycle.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "java-pro",
    "category": "Development",
    "description": "Master Java 21+ with modern features like virtual threads, pattern",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "javascript-mastery",
    "category": "AI & Agents",
    "description": "\"Comprehensive JavaScript reference covering 33+ essential concepts every developer should know. From fundamentals like primitives and closures to advanced patterns like async/await and functional programming. Use when explaining JS concepts, debugging JavaScript issues, or teaching JavaScript fundamentals.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "javascript-pro",
    "category": "Development",
    "description": "Master modern JavaScript with ES6+, async patterns, and Node.js",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "javascript-testing-patterns",
    "category": "Automation",
    "description": "Implement comprehensive testing strategies using Jest, Vitest, and Testing Library for unit tests, integration tests, and end-to-end testing with mocking, fixtures, and test-driven development. Use when writing JavaScript/TypeScript tests, setting up test infrastructure, or implementing TDD/BDD workflows.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "javascript-typescript-typescript-scaffold",
    "category": "Frontend",
    "description": "\"You are a TypeScript project architecture expert specializing in scaffolding production-ready Node.js and frontend applications. Generate complete project structures with modern tooling (pnpm, Vite, N\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "jira-automation",
    "category": "Automation",
    "description": "\"Automate Jira tasks via Rube MCP (Composio): issues, projects, sprints, boards, comments, users. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "julia-pro",
    "category": "Development",
    "description": "Master Julia 1.10+ with modern features, performance optimization,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "k8s-manifest-generator",
    "category": "Security",
    "description": "Create production-ready Kubernetes manifests for Deployments, Services, ConfigMaps, and Secrets following best practices and security standards. Use when generating Kubernetes YAML manifests, creating K8s resources, or implementing production-grade Kubernetes configurations.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "k8s-security-policies",
    "category": "Security",
    "description": "Implement Kubernetes security policies including NetworkPolicy, PodSecurityPolicy, and RBAC for production-grade security. Use when securing Kubernetes clusters, implementing network isolation, or enforcing pod security standards.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "kaizen",
    "category": "Frontend",
    "description": "Guide for continuous improvement, error proofing, and standardization. Use this skill when the user wants to improve code quality, refactor, or discuss process improvements.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "klaviyo-automation",
    "category": "AI & Agents",
    "description": "\"Automate Klaviyo tasks via Rube MCP (Composio): manage email/SMS campaigns, inspect campaign messages, track tags, and monitor send jobs. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "kpi-dashboard-design",
    "category": "Frontend",
    "description": "Design effective KPI dashboards with metrics selection, visualization best practices, and real-time monitoring patterns. Use when building business dashboards, selecting metrics, or designing data visualization layouts.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "kubernetes-architect",
    "category": "DevOps",
    "description": "Expert Kubernetes architect specializing in cloud-native",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "langchain-architecture",
    "category": "Frontend",
    "description": "Design LLM applications using the LangChain framework with agents, memory, and tool integration patterns. Use when building LangChain applications, implementing AI agents, or creating complex LLM workflows.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "langfuse",
    "category": "AI & Agents",
    "description": "\"Expert in Langfuse - the open-source LLM observability platform. Covers tracing, prompt management, evaluation, datasets, and integration with LangChain, LlamaIndex, and OpenAI. Essential for debugging, monitoring, and improving LLM applications in production. Use when: langfuse, llm observability, llm tracing, prompt management, llm evaluation.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "langgraph",
    "category": "Frontend",
    "description": "\"Expert in LangGraph - the production-grade framework for building stateful, multi-actor AI applications. Covers graph construction, state management, cycles and branches, persistence with checkpointers, human-in-the-loop patterns, and the ReAct agent pattern. Used in production at LinkedIn, Uber, and 400+ companies. This is LangChain's recommended approach for building agents. Use when: langgraph, langchain agent, stateful agent, agent graph, react agent.\"",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "last30days",
    "category": "AI & Agents",
    "description": "Research a topic from the last 30 days on Reddit + X + Web, become an expert, and write copy-paste-ready prompts for the user's target tool.",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "launch-strategy",
    "category": "AI & Agents",
    "description": "\"When the user wants to plan a product launch, feature announcement, or release strategy. Also use when the user mentions 'launch,' 'Product Hunt,' 'feature release,' 'announcement,' 'go-to-market,' 'beta launch,' 'early access,' 'waitlist,' or 'product update.' This skill covers phased launches, channel strategy, and ongoing launch momentum.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "legacy-modernizer",
    "category": "Development",
    "description": "Refactor legacy codebases, migrate outdated frameworks, and",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "legal-advisor",
    "category": "AI & Agents",
    "description": "Draft privacy policies, terms of service, disclaimers, and legal",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "linear-automation",
    "category": "Automation",
    "description": "\"Automate Linear tasks via Rube MCP (Composio): issues, projects, cycles, teams, labels. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "linear-claude-skill",
    "category": "Development",
    "description": "\"Manage Linear issues, projects, and teams\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "linkedin-automation",
    "category": "Automation",
    "description": "\"Automate LinkedIn tasks via Rube MCP (Composio): create posts, manage profile, company info, comments, and image uploads. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "linkerd-patterns",
    "category": "Security",
    "description": "Implement Linkerd service mesh patterns for lightweight, security-focused service mesh deployments. Use when setting up Linkerd, configuring traffic policies, or implementing zero-trust networking with minimal overhead.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "lint-and-validate",
    "category": "Automation",
    "description": "\"Automatic quality control, linting, and static analysis procedures. Use after every code modification to ensure syntax correctness and project standards. Triggers onKeywords: lint, format, check, validate, types, static analysis.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "Linux Privilege Escalation",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"escalate privileges on Linux\", \"find privesc vectors on Linux systems\", \"exploit sudo misconfigurations\", \"abuse SUID binaries\", \"exploit cron jobs for root access\", \"enumerate Linux systems for privilege escalation\", or \"gain root access from low-privilege shell\". It provides comprehensive techniques for identifying and exploiting privilege escalation paths on Linux systems.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Linux Production Shell Scripts",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"create bash scripts\", \"automate Linux tasks\", \"monitor system resources\", \"backup files\", \"manage users\", or \"write production shell scripts\". It provides ready-to-use shell script templates for system administration.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "llm-app-patterns",
    "category": "Frontend",
    "description": "\"Production-ready patterns for building LLM applications. Covers RAG pipelines, agent architectures, prompt IDEs, and LLMOps monitoring. Use when designing AI applications, implementing RAG, building agents, or setting up LLM observability.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "llm-application-dev-ai-assistant",
    "category": "Frontend",
    "description": "\"You are an AI assistant development expert specializing in creating intelligent conversational interfaces, chatbots, and AI-powered applications. Design comprehensive AI assistant solutions with natur\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "llm-application-dev-langchain-agent",
    "category": "AI & Agents",
    "description": "\"You are an expert LangChain agent developer specializing in production-grade AI systems using LangChain 0.1+ and LangGraph.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "llm-application-dev-prompt-optimize",
    "category": "AI & Agents",
    "description": "\"You are an expert prompt engineer specializing in crafting effective prompts for LLMs through advanced techniques including constitutional AI, chain-of-thought reasoning, and model-specific optimizati\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "llm-evaluation",
    "category": "AI & Agents",
    "description": "Implement comprehensive evaluation strategies for LLM applications using automated metrics, human feedback, and benchmarking. Use when testing LLM performance, measuring AI application quality, or establishing evaluation frameworks.",
    "tags": [
      "AI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "loki-mode",
    "category": "Frontend",
    "description": "Multi-agent autonomous startup system for Claude Code. Triggers on \"Loki Mode\". Orchestrates 100+ specialized agents across engineering, QA, DevOps, security, data/ML, business operations, marketing, HR, and customer success. Takes PRD to fully deployed, revenue-generating product with zero human intervention. Features Task tool for subagent dispatch, parallel code review with 3 specialized reviewers, severity-based issue triage, distributed task queue with dead letter handling, automatic deployment to cloud providers, A/B testing, customer feedback loops, incident response, circuit breakers, and self-healing. Handles rate limits via distributed state checkpoints and auto-resume with exponential backoff. Requires --dangerously-skip-permissions flag.",
    "tags": [
      "UI",
      "Security",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "machine-learning-ops-ml-pipeline",
    "category": "Frontend",
    "description": "\"Design and implement a complete ML pipeline for: $ARGUMENTS\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mailchimp-automation",
    "category": "AI & Agents",
    "description": "\"Automate Mailchimp email marketing including campaigns, audiences, subscribers, segments, and analytics via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "make-automation",
    "category": "Automation",
    "description": "\"Automate Make (Integromat) tasks via Rube MCP (Composio): operations, enums, language and timezone lookups. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "makepad-skills",
    "category": "Frontend",
    "description": "\"Makepad UI development skills for Rust apps: setup, patterns, shaders, packaging, and troubleshooting.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "malware-analyst",
    "category": "Development",
    "description": "Expert malware analyst specializing in defensive malware research,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "market-sizing-analysis",
    "category": "Development",
    "description": "This skill should be used when the user asks to \"calculate TAM\",",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "marketing-ideas",
    "category": "Marketing",
    "description": "Provide proven marketing strategies and growth ideas for SaaS and software products, prioritized using a marketing feasibility scoring system.",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "marketing-psychology",
    "category": "Marketing",
    "description": "Apply behavioral science and mental models to marketing decisions, prioritized using a psychological leverage and feasibility scoring system.",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "mcp-builder",
    "category": "Frontend",
    "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK).",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "memory-forensics",
    "category": "Frontend",
    "description": "Master memory forensics techniques including memory acquisition, process analysis, and artifact extraction using Volatility and related tools. Use when analyzing memory dumps, investigating incidents, or performing malware analysis from RAM captures.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "memory-safety-patterns",
    "category": "AI & Agents",
    "description": "Implement memory-safe programming with RAII, ownership, smart pointers, and resource management across Rust, C++, and C. Use when writing safe systems code, managing resources, or preventing memory bugs.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "memory-systems",
    "category": "Frontend",
    "description": "\"Design short-term, long-term, and graph-based memory architectures\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mermaid-expert",
    "category": "AI & Agents",
    "description": "Create Mermaid diagrams for flowcharts, sequences, ERDs, and",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "Metasploit Framework",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"use Metasploit for penetration testing\", \"exploit vulnerabilities with msfconsole\", \"create payloads with msfvenom\", \"perform post-exploitation\", \"use auxiliary modules for scanning\", or \"develop custom exploits\". It provides comprehensive guidance for leveraging the Metasploit Framework in security assessments.",
    "tags": [
      "UI",
      "Security",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "micro-saas-launcher",
    "category": "Frontend",
    "description": "\"Expert in launching small, focused SaaS products fast - the indie hacker approach to building profitable software. Covers idea validation, MVP development, pricing, launch strategies, and growing to sustainable revenue. Ship in weeks, not months. Use when: micro saas, indie hacker, small saas, side project, saas mvp.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "microservices-patterns",
    "category": "Frontend",
    "description": "Design microservices architectures with service boundaries, event-driven communication, and resilience patterns. Use when building distributed systems, decomposing monoliths, or implementing microservices.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "microsoft-teams-automation",
    "category": "Automation",
    "description": "\"Automate Microsoft Teams tasks via Rube MCP (Composio): send messages, manage channels, create meetings, handle chats, and search messages. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "minecraft-bukkit-pro",
    "category": "Backend",
    "description": "Master Minecraft server plugin development with Bukkit, Spigot, and",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "miro-automation",
    "category": "Automation",
    "description": "\"Automate Miro tasks via Rube MCP (Composio): boards, items, sticky notes, frames, sharing, connectors. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "mixpanel-automation",
    "category": "Automation",
    "description": "\"Automate Mixpanel tasks via Rube MCP (Composio): events, segmentation, funnels, cohorts, user profiles, JQL queries. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "ml-engineer",
    "category": "Frontend",
    "description": "Build production ML systems with PyTorch 2.x, TensorFlow, and",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ml-pipeline-workflow",
    "category": "Frontend",
    "description": "Build end-to-end MLOps pipelines from data preparation through model training, validation, and production deployment. Use when creating ML pipelines, implementing MLOps practices, or automating model training and deployment workflows.",
    "tags": [
      "UI",
      "AI",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mlops-engineer",
    "category": "Frontend",
    "description": "Build comprehensive ML pipelines, experiment tracking, and model",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mobile-design",
    "category": "Frontend",
    "description": "Mobile-first design and engineering doctrine for iOS and Android apps. Covers touch interaction, performance, platform conventions, offline behavior, and mobile-specific decision-making. Teaches principles and constraints, not fixed layouts. Use for React Native, Flutter, or native mobile apps.",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mobile-developer",
    "category": "Frontend",
    "description": "Develop React Native, Flutter, or native mobile apps with modern",
    "tags": [
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mobile-security-coder",
    "category": "Security",
    "description": "Expert in secure mobile coding practices specializing in input",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "modern-javascript-patterns",
    "category": "AI & Agents",
    "description": "Master ES6+ features including async/await, destructuring, spread operators, arrow functions, promises, modules, iterators, generators, and functional programming patterns for writing clean, efficient JavaScript code. Use when refactoring legacy code, implementing modern patterns, or optimizing JavaScript applications.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "monday-automation",
    "category": "Automation",
    "description": "\"Automate Monday.com work management including boards, items, columns, groups, subitems, and updates via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "monorepo-architect",
    "category": "Frontend",
    "description": "\"Expert in monorepo architecture, build systems, and dependency management at scale. Masters Nx, Turborepo, Bazel, and Lerna for efficient multi-project development. Use PROACTIVELY for monorepo setup,\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "monorepo-management",
    "category": "Frontend",
    "description": "Master monorepo management with Turborepo, Nx, and pnpm workspaces to build efficient, scalable multi-package repositories with optimized builds and dependency management. Use when setting up monorepos, optimizing builds, or managing shared dependencies.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "moodle-external-api-development",
    "category": "Frontend",
    "description": "Create custom external web service APIs for Moodle LMS. Use when implementing web services for course management, user tracking, quiz operations, or custom plugin functionality. Covers parameter validation, database operations, error handling, service registration, and Moodle coding standards.",
    "tags": [
      "UI",
      "API",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "mtls-configuration",
    "category": "Development",
    "description": "Configure mutual TLS (mTLS) for zero-trust service-to-service communication. Use when implementing zero-trust networking, certificate management, or securing internal service communication.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "multi-agent-brainstorming",
    "category": "AI & Agents",
    "description": ">",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "multi-agent-patterns",
    "category": "AI & Agents",
    "description": "\"Master orchestrator, peer-to-peer, and hierarchical multi-agent architectures\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "multi-cloud-architecture",
    "category": "Frontend",
    "description": "Design multi-cloud architectures using a decision framework to select and integrate services across AWS, Azure, and GCP. Use when building multi-cloud systems, avoiding vendor lock-in, or leveraging best-of-breed services from multiple providers.",
    "tags": [
      "UI",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "multi-platform-apps-multi-platform",
    "category": "Frontend",
    "description": "\"Build and deploy the same feature consistently across web, mobile, and desktop platforms using API-first architecture and parallel implementation strategies.\"",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "n8n-code-python",
    "category": "Development",
    "description": "\"Write Python code in n8n Code nodes. Use when writing Python in n8n, using _input/_json/_node syntax, working with standard library, or need to understand Python limitations in n8n Code nodes.\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "n8n-mcp-tools-expert",
    "category": "Frontend",
    "description": "\"Expert guide for using n8n-mcp MCP tools effectively. Use when searching for nodes, validating configurations, accessing templates, managing workflows, or using any n8n-mcp tool. Provides tool selection guidance, parameter formats, and common patterns.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "n8n-node-configuration",
    "category": "Frontend",
    "description": "\"Operation-aware node configuration guidance. Use when configuring nodes, understanding property dependencies, determining required fields, choosing between get_node detail levels, or learning common configuration patterns by node type.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "nanobanana-ppt-skills",
    "category": "AI & Agents",
    "description": "\"AI-powered PPT generation with document analysis and styled images\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "neon-postgres",
    "category": "Backend",
    "description": "\"Expert patterns for Neon serverless Postgres, branching, connection pooling, and Prisma/Drizzle integration Use when: neon database, serverless postgres, database branching, neon postgres, postgres serverless.\"",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "nestjs-expert",
    "category": "Security",
    "description": "Nest.js framework expert specializing in module architecture, dependency injection, middleware, guards, interceptors, testing with Jest/Supertest, TypeORM/Mongoose integration, and Passport.js authentication. Use PROACTIVELY for any Nest.js application issues including architecture decisions, testing strategies, performance optimization, or debugging complex dependency injection problems. If a specialized expert is a better fit, I will recommend switching and stop.",
    "tags": [
      "Security",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "Network 101",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"set up a web server\", \"configure HTTP or HTTPS\", \"perform SNMP enumeration\", \"configure SMB shares\", \"test network services\", or needs guidance on configuring and testing network services for penetration testing labs.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "network-engineer",
    "category": "DevOps",
    "description": "Expert network engineer specializing in modern cloud networking,",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "nextjs-app-router-patterns",
    "category": "Frontend",
    "description": "Master Next.js 14+ App Router with Server Components, streaming, parallel routes, and advanced data fetching. Use when building Next.js applications, implementing SSR/SSG, or optimizing React Server Components.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "nextjs-best-practices",
    "category": "Backend",
    "description": "Next.js App Router principles. Server Components, data fetching, routing patterns.",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "nextjs-supabase-auth",
    "category": "Security",
    "description": "\"Expert integration of Supabase Auth with Next.js App Router Use when: supabase auth next, authentication next.js, login supabase, auth middleware, protected route.\"",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "nft-standards",
    "category": "Frontend",
    "description": "Implement NFT standards (ERC-721, ERC-1155) with proper metadata handling, minting strategies, and marketplace integration. Use when creating NFT contracts, building NFT marketplaces, or implementing digital asset systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "nodejs-backend-patterns",
    "category": "Frontend",
    "description": "Build production-ready Node.js backend services with Express/Fastify, implementing middleware patterns, error handling, authentication, database integration, and API design best practices. Use when creating Node.js servers, REST APIs, GraphQL backends, or microservices architectures.",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "nodejs-best-practices",
    "category": "Security",
    "description": "Node.js development principles and decision-making. Framework selection, async patterns, security, and architecture. Teaches thinking, not copying.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "nosql-expert",
    "category": "Frontend",
    "description": "\"Expert guidance for distributed NoSQL databases (Cassandra, DynamoDB). Focuses on mental models, query-first modeling, single-table design, and avoiding hot partitions in high-scale systems.\"",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "notebooklm",
    "category": "Security",
    "description": "Use this skill to query your Google NotebookLM notebooks directly from Claude Code for source-grounded, citation-backed answers from Gemini. Browser automation, library management, persistent auth. Drastically reduced hallucinations through document-only responses.",
    "tags": [
      "Security",
      "Automation"
    ],
    "categorySlug": "security"
  },
  {
    "name": "notion-automation",
    "category": "Backend",
    "description": "\"Automate Notion tasks via Rube MCP (Composio): pages, databases, blocks, comments, users. Always search tools first for current schemas.\"",
    "tags": [
      "Automation",
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "notion-template-business",
    "category": "Frontend",
    "description": "\"Expert in building and selling Notion templates as a business - not just making templates, but building a sustainable digital product business. Covers template design, pricing, marketplaces, marketing, and scaling to real revenue. Use when: notion template, sell templates, digital product, notion business, gumroad.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "nx-workspace-patterns",
    "category": "Frontend",
    "description": "Configure and optimize Nx monorepo workspaces. Use when setting up Nx, configuring project boundaries, optimizing build caching, or implementing affected commands.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "observability-engineer",
    "category": "Frontend",
    "description": "Build production-ready monitoring, logging, and tracing systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "observability-monitoring-monitor-setup",
    "category": "Data & Analytics",
    "description": "\"You are a monitoring and observability expert specializing in implementing comprehensive monitoring solutions. Set up metrics collection, distributed tracing, log aggregation, and create insightful da\"",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "observability-monitoring-slo-implement",
    "category": "Frontend",
    "description": "\"You are an SLO (Service Level Objective) expert specializing in implementing reliability standards and error budget-based practices. Design SLO frameworks, define SLIs, and build monitoring that balances reliability with delivery velocity.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "observe-whatsapp",
    "category": "Backend",
    "description": "\"Observe and troubleshoot WhatsApp in Kapso: debug message delivery, inspect webhook deliveries/retries, triage API errors, and run health checks. Use when investigating production issues, message failures, or webhook delivery problems.\"",
    "tags": [
      "API",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "obsidian-clipper-template-creator",
    "category": "Frontend",
    "description": "Guide for creating templates for the Obsidian Web Clipper. Use when you want to create a new clipping template, understand available variables, or format clipped content.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "on-call-handoff-patterns",
    "category": "Development",
    "description": "Master on-call shift handoffs with context transfer, escalation procedures, and documentation. Use when transitioning on-call responsibilities, documenting shift summaries, or improving on-call processes.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "onboarding-cro",
    "category": "AI & Agents",
    "description": "When the user wants to optimize post-signup onboarding, user activation, first-run experience, or time-to-value. Also use when the user mentions \"onboarding flow,\" \"activation rate,\" \"user activation,\" \"first-run experience,\" \"empty states,\" \"onboarding checklist,\" \"aha moment,\" or \"new user experience.\" For signup/registration optimization, see signup-flow-cro. For ongoing email sequences, see email-sequence.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "one-drive-automation",
    "category": "Automation",
    "description": "\"Automate OneDrive file management, search, uploads, downloads, sharing, permissions, and folder operations via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "openapi-spec-generation",
    "category": "Frontend",
    "description": "Generate and maintain OpenAPI 3.1 specifications from code, design-first specs, and validation patterns. Use when creating API documentation, generating SDKs, or ensuring API contract compliance.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "oss-hunter",
    "category": "Automation",
    "description": "Automatically hunt for high-impact OSS contribution opportunities in trending repositories.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "outlook-automation",
    "category": "AI & Agents",
    "description": "\"Automate Outlook tasks via Rube MCP (Composio): emails, calendar, contacts, folders, attachments. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "outlook-calendar-automation",
    "category": "Automation",
    "description": "\"Automate Outlook Calendar tasks via Rube MCP (Composio): create events, manage attendees, find meeting times, and handle invitations. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "page-cro",
    "category": "Development",
    "description": ">",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "pagerduty-automation",
    "category": "Automation",
    "description": "\"Automate PagerDuty tasks via Rube MCP (Composio): manage incidents, services, schedules, escalation policies, and on-call rotations. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "paid-ads",
    "category": "AI & Agents",
    "description": "\"When the user wants help with paid advertising campaigns on Google Ads, Meta (Facebook/Instagram), LinkedIn, Twitter/X, or other ad platforms. Also use when the user mentions 'PPC,' 'paid media,' 'ad copy,' 'ad creative,' 'ROAS,' 'CPA,' 'ad campaign,' 'retargeting,' or 'audience targeting.' This skill covers campaign strategy, ad creation, audience targeting, and optimization.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "parallel-agents",
    "category": "Frontend",
    "description": "Multi-agent orchestration patterns. Use when multiple independent tasks can run with different domain expertise or when comprehensive analysis requires multiple perspectives.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "payment-integration",
    "category": "Development",
    "description": "Integrate Stripe, PayPal, and payment processors. Handles checkout",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "paypal-integration",
    "category": "Frontend",
    "description": "Integrate PayPal payment processing with support for express checkout, subscriptions, and refund management. Use when implementing PayPal payments, processing online transactions, or building e-commerce checkout flows.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "paywall-upgrade-cro",
    "category": "AI & Agents",
    "description": "When the user wants to create or optimize in-app paywalls, upgrade screens, upsell modals, or feature gates. Also use when the user mentions \"paywall,\" \"upgrade screen,\" \"upgrade modal,\" \"upsell,\" \"feature gate,\" \"convert free to paid,\" \"freemium conversion,\" \"trial expiration screen,\" \"limit reached screen,\" \"plan upgrade prompt,\" or \"in-app pricing.\" Distinct from public pricing pages (see page-cro) — this skill focuses on in-product upgrade moments where the user has already experienced value.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "pci-compliance",
    "category": "Frontend",
    "description": "Implement PCI DSS compliance requirements for secure handling of payment card data and payment systems. Use when securing payment processing, achieving PCI compliance, or implementing payment card security measures.",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "pdf",
    "category": "Development",
    "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "Pentest Checklist",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"plan a penetration test\", \"create a security assessment checklist\", \"prepare for penetration testing\", \"define pentest scope\", \"follow security testing best practices\", or needs a structured methodology for penetration testing engagements.",
    "tags": [
      "Security",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "Pentest Commands",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"run pentest commands\", \"scan with nmap\", \"use metasploit exploits\", \"crack passwords with hydra or john\", \"scan web vulnerabilities with nikto\", \"enumerate networks\", or needs essential penetration testing command references.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "performance-engineer",
    "category": "Development",
    "description": "Expert performance engineer specializing in modern observability,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "performance-profiling",
    "category": "Development",
    "description": "Performance profiling principles. Measurement, analysis, and optimization techniques.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "performance-testing-review-ai-review",
    "category": "AI & Agents",
    "description": "\"You are an expert AI-powered code review specialist combining automated static analysis, intelligent pattern recognition, and modern DevOps practices. Leverage AI tools (GitHub Copilot, Qodo, GPT-5, C\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "performance-testing-review-multi-agent-review",
    "category": "AI & Agents",
    "description": "\"Use when working with performance testing review multi agent review\"",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "personal-tool-builder",
    "category": "Frontend",
    "description": "\"Expert in building custom tools that solve your own problems first. The best products often start as personal tools - scratch your own itch, build for yourself, then discover others have the same itch. Covers rapid prototyping, local-first apps, CLI tools, scripts that grow into products, and the art of dogfooding. Use when: build a tool, personal tool, scratch my itch, solve my problem, CLI tool.\"",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "php-pro",
    "category": "Data & Analytics",
    "description": "Write idiomatic PHP code with generators, iterators, SPL data",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "pipedrive-automation",
    "category": "Automation",
    "description": "\"Automate Pipedrive CRM operations including deals, contacts, organizations, activities, notes, and pipeline management via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "plaid-fintech",
    "category": "Backend",
    "description": "\"Expert patterns for Plaid API integration including Link token flows, transactions sync, identity verification, Auth for ACH, balance checks, webhook handling, and fintech compliance best practices. Use when: plaid, bank account linking, bank connection, ach, account aggregation.\"",
    "tags": [
      "API",
      "Security",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "plan-writing",
    "category": "Development",
    "description": "Structured task planning with clear breakdowns, dependencies, and verification criteria. Use when implementing features, refactoring, or any multi-step work.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "planning-with-files",
    "category": "Frontend",
    "description": "Implements Manus-style file-based planning for complex tasks. Creates task_plan.md, findings.md, and progress.md. Use when starting complex multi-step tasks, research projects, or any task requiring >5 tool calls.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "playwright-skill",
    "category": "Frontend",
    "description": "Complete browser automation with Playwright. Auto-detects dev servers, writes clean test scripts to /tmp. Test pages, fill forms, take screenshots, check responsive design, validate UX, test login flows, check links, automate any browser task. Use when user wants to test websites, automate browser interactions, validate web functionality, or perform any browser-based testing.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "popup-cro",
    "category": "Development",
    "description": "Create and optimize popups, modals, overlays, slide-ins, and banners to increase conversions without harming user experience or brand trust.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "posix-shell-pro",
    "category": "Development",
    "description": "Expert in strict POSIX sh scripting for maximum portability across",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "supabase-postgres-best-practices",
    "category": "Frontend",
    "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations.",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "postgresql",
    "category": "Frontend",
    "description": "Design a PostgreSQL-specific schema. Covers best-practices, data types, indexing, constraints, performance patterns, and advanced features",
    "tags": [
      "UI",
      "AI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "posthog-automation",
    "category": "Automation",
    "description": "\"Automate PostHog tasks via Rube MCP (Composio): events, feature flags, projects, user profiles, annotations. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "postmark-automation",
    "category": "AI & Agents",
    "description": "\"Automate Postmark email delivery tasks via Rube MCP (Composio): send templated emails, manage templates, monitor delivery stats and bounces. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "postmortem-writing",
    "category": "Development",
    "description": "Write effective blameless postmortems with root cause analysis, timelines, and action items. Use when conducting incident reviews, writing postmortem documents, or improving incident response processes.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "powershell-windows",
    "category": "Development",
    "description": "PowerShell Windows patterns. Critical pitfalls, operator syntax, error handling.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "pptx",
    "category": "Marketing",
    "description": "\"Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "pricing-strategy",
    "category": "Frontend",
    "description": "Design pricing, packaging, and monetization strategies based on value, customer willingness to pay, and growth objectives.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "prisma-expert",
    "category": "Frontend",
    "description": "Prisma ORM expert for schema design, migrations, query optimization, relations modeling, and database operations. Use PROACTIVELY for Prisma schema issues, migration problems, query performance, relation design, or database connection issues.",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Privilege Escalation Methods",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"escalate privileges\", \"get root access\", \"become administrator\", \"privesc techniques\", \"abuse sudo\", \"exploit SUID binaries\", \"Kerberoasting\", \"pass-the-ticket\", \"token impersonation\", or needs guidance on post-exploitation privilege escalation for Linux or Windows systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "product-manager-toolkit",
    "category": "Frontend",
    "description": "Comprehensive toolkit for product managers including RICE prioritization, customer interview analysis, PRD templates, discovery frameworks, and go-to-market strategies. Use for feature prioritization, user research synthesis, requirement documentation, and product strategy development.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "production-code-audit",
    "category": "AI & Agents",
    "description": "\"Autonomously deep-scan entire codebase line-by-line, understand architecture and patterns, then systematically transform it to production-grade, corporate-level professional quality with optimizations\"",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "programmatic-seo",
    "category": "Marketing",
    "description": ">",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "projection-patterns",
    "category": "Frontend",
    "description": "Build read models and projections from event streams. Use when implementing CQRS read sides, building materialized views, or optimizing query performance in event-sourced systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "prometheus-configuration",
    "category": "Data & Analytics",
    "description": "Set up Prometheus for comprehensive metric collection, storage, and monitoring of infrastructure and applications. Use when implementing metrics collection, setting up monitoring infrastructure, or configuring alerting systems.",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "prompt-caching",
    "category": "Backend",
    "description": "\"Caching strategies for LLM prompts including Anthropic prompt caching, response caching, and CAG (Cache Augmented Generation) Use when: prompt caching, cache prompt, response cache, cag, cache augmented.\"",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "prompt-engineer",
    "category": "AI & Agents",
    "description": "\"Transforms user prompts into optimized prompts using frameworks (RTF, RISEN, Chain of Thought, RODES, Chain of Density, RACE, RISE, STAR, SOAP, CLEAR, GROW)\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "prompt-engineering",
    "category": "Frontend",
    "description": "Expert guide on prompt engineering patterns, best practices, and optimization techniques. Use when user wants to improve prompts, learn prompting strategies, or debug agent behavior.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "prompt-engineering-patterns",
    "category": "Frontend",
    "description": "Master advanced prompt engineering techniques to maximize LLM performance, reliability, and controllability in production. Use when optimizing prompts, improving LLM outputs, or designing production prompt templates.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "prompt-library",
    "category": "AI & Agents",
    "description": "\"Curated collection of high-quality prompts for various use cases. Includes role-based prompts, task-specific templates, and prompt refinement techniques. Use when user needs prompt templates, role-play prompts, or ready-to-use prompt examples for coding, writing, analysis, or creative tasks.\"",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "protocol-reverse-engineering",
    "category": "Development",
    "description": "Master network protocol reverse engineering including packet analysis, protocol dissection, and custom protocol documentation. Use when analyzing network traffic, understanding proprietary protocols, or debugging network communication.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "pypict-skill",
    "category": "AI & Agents",
    "description": "\"Pairwise test generation\"",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "python-development-python-scaffold",
    "category": "Backend",
    "description": "\"You are a Python project architecture expert specializing in scaffolding production-ready Python applications. Generate complete project structures with modern tooling (uv, FastAPI, Django), type hint\"",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "python-packaging",
    "category": "Development",
    "description": "Create distributable Python packages with proper project structure, setup.py/pyproject.toml, and publishing to PyPI. Use when packaging Python libraries, creating CLI tools, or distributing Python code.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "python-patterns",
    "category": "Development",
    "description": "Python development principles and decision-making. Framework selection, async patterns, type hints, project structure. Teaches thinking, not copying.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "python-performance-optimization",
    "category": "Development",
    "description": "Profile and optimize Python code using cProfile, memory profilers, and performance best practices. Use when debugging slow Python code, optimizing bottlenecks, or improving application performance.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "python-pro",
    "category": "Development",
    "description": "Master Python 3.12+ with modern features, async programming,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "python-testing-patterns",
    "category": "Frontend",
    "description": "Implement comprehensive testing strategies with pytest, fixtures, mocking, and test-driven development. Use when writing Python tests, setting up test suites, or implementing testing best practices.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "quant-analyst",
    "category": "Frontend",
    "description": "Build financial models, backtest trading strategies, and analyze",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "radix-ui-design-system",
    "category": "Frontend",
    "description": "Build accessible design systems with Radix UI primitives. Headless component customization, theming strategies, and compound component patterns for production-grade UI libraries.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "rag-engineer",
    "category": "Frontend",
    "description": "\"Expert in building Retrieval-Augmented Generation systems. Masters embedding models, vector databases, chunking strategies, and retrieval optimization for LLM applications. Use when: building RAG, vector search, embeddings, semantic search, document retrieval.\"",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "rag-implementation",
    "category": "Frontend",
    "description": "Build Retrieval-Augmented Generation (RAG) systems for LLM applications with vector databases and semantic search. Use when implementing knowledge-grounded AI, building document Q&A systems, or integrating LLMs with external knowledge bases.",
    "tags": [
      "UI",
      "AI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "vercel-react-best-practices",
    "category": "Frontend",
    "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "react-modernization",
    "category": "Frontend",
    "description": "Upgrade React applications to latest versions, migrate from class components to hooks, and adopt concurrent features. Use when modernizing React codebases, migrating to React Hooks, or upgrading to latest React versions.",
    "tags": [
      "React",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "react-native-architecture",
    "category": "Frontend",
    "description": "Build production React Native apps with Expo, navigation, native modules, offline sync, and cross-platform patterns. Use when developing mobile apps, implementing native integrations, or architecting React Native projects.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "react-patterns",
    "category": "Frontend",
    "description": "Modern React patterns and principles. Hooks, composition, performance, TypeScript best practices.",
    "tags": [
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "react-state-management",
    "category": "Frontend",
    "description": "Master modern React state management with Redux Toolkit, Zustand, Jotai, and React Query. Use when setting up global state, managing server state, or choosing between state management solutions.",
    "tags": [
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "react-ui-patterns",
    "category": "Frontend",
    "description": "Modern React UI patterns for loading states, error handling, and data fetching. Use when building UI components, handling async data, or managing UI states.",
    "tags": [
      "UI",
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "readme",
    "category": "Automation",
    "description": "\"When the user wants to create or update a README.md file for a project. Also use when the user says 'write readme,' 'create readme,' 'document this project,' 'project documentation,' or asks for help with README.md. This skill creates absurdly thorough documentation covering local setup, architecture, and deployment.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "receiving-code-review",
    "category": "Frontend",
    "description": "Use when receiving code review feedback, before implementing suggestions, especially if feedback seems unclear or technically questionable - requires technical rigor and verification, not performative agreement or blind implementation",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "red-team-tactics",
    "category": "Development",
    "description": "Red team tactics principles based on MITRE ATT&CK. Attack phases, detection evasion, reporting.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "Red Team Tools and Methodology",
    "category": "AI & Agents",
    "description": "This skill should be used when the user asks to \"follow red team methodology\", \"perform bug bounty hunting\", \"automate reconnaissance\", \"hunt for XSS vulnerabilities\", \"enumerate subdomains\", or needs security researcher techniques and tool configurations from top bug bounty hunters.",
    "tags": [
      "Security",
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "reddit-automation",
    "category": "Automation",
    "description": "\"Automate Reddit tasks via Rube MCP (Composio): search subreddits, create posts, manage comments, and browse top content. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "reference-builder",
    "category": "Frontend",
    "description": "Creates exhaustive technical references and API documentation.",
    "tags": [
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "referral-program",
    "category": "Frontend",
    "description": "\"When the user wants to create, optimize, or analyze a referral program, affiliate program, or word-of-mouth strategy. Also use when the user mentions 'referral,' 'affiliate,' 'ambassador,' 'word of mouth,' 'viral loop,' 'refer a friend,' or 'partner program.' This skill covers program design, incentive structure, and growth optimization.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "remotion-best-practices",
    "category": "Frontend",
    "description": "Best practices for Remotion - Video creation in React",
    "tags": [
      "React"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "render-automation",
    "category": "Automation",
    "description": "\"Automate Render tasks via Rube MCP (Composio): services, deployments, projects. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "requesting-code-review",
    "category": "Frontend",
    "description": "Use when completing tasks, implementing major features, or before merging to verify work meets requirements",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "research-engineer",
    "category": "Frontend",
    "description": "\"An uncompromising Academic Research Engineer. Operates with absolute scientific rigor, objective criticism, and zero flair. Focuses on theoretical correctness, formal verification, and optimal implementation across any required technology.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "reverse-engineer",
    "category": "Development",
    "description": "Expert reverse engineer specializing in binary analysis,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "risk-manager",
    "category": "Development",
    "description": "Monitor portfolio risk, R-multiples, and position limits. Creates",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "risk-metrics-calculation",
    "category": "Frontend",
    "description": "Calculate portfolio risk metrics including VaR, CVaR, Sharpe, Sortino, and drawdown analysis. Use when measuring portfolio risk, implementing risk limits, or building risk monitoring systems.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ruby-pro",
    "category": "AI & Agents",
    "description": "Write idiomatic Ruby code with metaprogramming, Rails patterns, and",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "rust-async-patterns",
    "category": "Frontend",
    "description": "Master Rust async programming with Tokio, async traits, error handling, and concurrent patterns. Use when building async Rust applications, implementing concurrent systems, or debugging async code.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "rust-pro",
    "category": "Development",
    "description": "Master Rust 1.75+ with modern async patterns, advanced type system",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "saga-orchestration",
    "category": "Automation",
    "description": "Implement saga patterns for distributed transactions and cross-aggregate workflows. Use when coordinating multi-step business processes, handling compensating transactions, or managing long-running workflows.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "sales-automator",
    "category": "AI & Agents",
    "description": "Draft cold emails, follow-ups, and proposal templates. Creates",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "salesforce-automation",
    "category": "Automation",
    "description": "\"Automate Salesforce tasks via Rube MCP (Composio): leads, contacts, accounts, opportunities, SOQL queries. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "salesforce-development",
    "category": "Backend",
    "description": "\"Expert patterns for Salesforce platform development including Lightning Web Components (LWC), Apex triggers and classes, REST/Bulk APIs, Connected Apps, and Salesforce DX with scratch orgs and 2nd generation packages (2GP). Use when: salesforce, sfdc, apex, lwc, lightning web components.\"",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "sast-configuration",
    "category": "Security",
    "description": "Configure Static Application Security Testing (SAST) tools for automated vulnerability detection in application code. Use when setting up security scanning, implementing DevSecOps practices, or automating code vulnerability detection.",
    "tags": [
      "Security",
      "Automation",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "scala-pro",
    "category": "Development",
    "description": "Master enterprise-grade Scala development with functional",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "Security Scanning Tools",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"perform vulnerability scanning\", \"scan networks for open ports\", \"assess web application security\", \"scan wireless networks\", \"detect malware\", \"check cloud security\", or \"evaluate system compliance\". It provides comprehensive guidance on security scanning tools and methodologies.",
    "tags": [
      "UI",
      "Security",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "schema-markup",
    "category": "Development",
    "description": ">",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "screen-reader-testing",
    "category": "DevOps",
    "description": "Test web applications with screen readers including VoiceOver, NVDA, and JAWS. Use when validating screen reader compatibility, debugging accessibility issues, or ensuring assistive technology support.",
    "tags": [
      "Testing",
      "Cloud"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "screenshots",
    "category": "Marketing",
    "description": "\"Generate marketing screenshots of your app using Playwright. Use when the user wants to create screenshots for Product Hunt, social media, landing pages, or documentation.\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "scroll-experience",
    "category": "Frontend",
    "description": "\"Expert in building immersive scroll-driven experiences - parallax storytelling, scroll animations, interactive narratives, and cinematic web experiences. Like NY Times interactives, Apple product pages, and award-winning web experiences. Makes websites feel like experiences, not just pages. Use when: scroll animation, parallax, scroll storytelling, interactive story, cinematic website.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "search-specialist",
    "category": "Development",
    "description": "Expert web researcher using advanced search techniques and",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "secrets-management",
    "category": "Automation",
    "description": "Implement secure secrets management for CI/CD pipelines using Vault, AWS Secrets Manager, or native platform solutions. Use when handling sensitive credentials, rotating secrets, or securing CI/CD environments.",
    "tags": [
      "Cloud"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "security-auditor",
    "category": "Security",
    "description": "Expert security auditor specializing in DevSecOps, comprehensive",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "security-bluebook-builder",
    "category": "Frontend",
    "description": "\"Build security Blue Books for sensitive apps\"",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "security-compliance-compliance-check",
    "category": "Frontend",
    "description": "\"You are a compliance expert specializing in regulatory requirements for software systems including GDPR, HIPAA, SOC2, PCI-DSS, and other industry standards. Perform compliance audits and provide implementation guidance.\"",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "security-requirement-extraction",
    "category": "Frontend",
    "description": "Derive security requirements from threat models and business context. Use when translating threats into actionable requirements, creating security user stories, or building security test cases.",
    "tags": [
      "UI",
      "Security",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "security-scanning-security-dependencies",
    "category": "AI & Agents",
    "description": "\"You are a security expert specializing in dependency vulnerability analysis, SBOM generation, and supply chain security. Scan project dependencies across ecosystems to identify vulnerabilities, assess risks, and recommend remediation.\"",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "security-scanning-security-hardening",
    "category": "Security",
    "description": "\"Coordinate multi-layer security scanning and hardening across application, infrastructure, and compliance controls.\"",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "security-scanning-security-sast",
    "category": "Security",
    "description": "Static Application Security Testing (SAST) for code vulnerability",
    "tags": [
      "Security",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "segment-automation",
    "category": "Automation",
    "description": "\"Automate Segment tasks via Rube MCP (Composio): track events, identify users, manage groups, page views, aliases, batch operations. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "segment-cdp",
    "category": "Backend",
    "description": "\"Expert patterns for Segment Customer Data Platform including Analytics.js, server-side tracking, tracking plans with Protocols, identity resolution, destinations configuration, and data governance best practices. Use when: segment, analytics.js, customer data platform, cdp, tracking plan.\"",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "sendgrid-automation",
    "category": "AI & Agents",
    "description": "\"Automate SendGrid email operations including sending emails, managing contacts/lists, sender identities, templates, and analytics via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "senior-architect",
    "category": "Frontend",
    "description": "Comprehensive software architecture skill for designing scalable, maintainable systems using ReactJS, NextJS, NodeJS, Express, React Native, Swift, Kotlin, Flutter, Postgres, GraphQL, Go, Python. Includes architecture diagram generation, system design patterns, tech stack decision frameworks, and dependency analysis. Use when designing system architecture, making technical decisions, creating architecture diagrams, evaluating trade-offs, or defining integration patterns.",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "senior-fullstack",
    "category": "Frontend",
    "description": "Comprehensive fullstack development skill for building complete web applications with React, Next.js, Node.js, GraphQL, and PostgreSQL. Includes project scaffolding, code quality analysis, architecture patterns, and complete tech stack guidance. Use when building new projects, analyzing code quality, implementing design patterns, or setting up development workflows.",
    "tags": [
      "UI",
      "React",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "sentry-automation",
    "category": "Automation",
    "description": "\"Automate Sentry tasks via Rube MCP (Composio): manage issues/events, configure alerts, track releases, monitor projects and teams. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "seo-audit",
    "category": "Marketing",
    "description": ">",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-authority-builder",
    "category": "Frontend",
    "description": "Analyzes content for E-E-A-T signals and suggests improvements to",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "seo-cannibalization-detector",
    "category": "Marketing",
    "description": "Analyzes multiple provided pages to identify keyword overlap and",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-content-auditor",
    "category": "Testing",
    "description": "Analyzes provided content for quality, E-E-A-T signals, and SEO",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "seo-content-planner",
    "category": "Marketing",
    "description": "Creates comprehensive content outlines and topic clusters for SEO.",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-content-refresher",
    "category": "Marketing",
    "description": "Identifies outdated elements in provided content and suggests",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-content-writer",
    "category": "Marketing",
    "description": "Writes SEO-optimized content based on provided keywords and topic",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-fundamentals",
    "category": "Marketing",
    "description": ">",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-keyword-strategist",
    "category": "Marketing",
    "description": "Analyzes keyword usage in provided content, calculates density,",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-meta-optimizer",
    "category": "Marketing",
    "description": "Creates optimized meta titles, descriptions, and URL suggestions",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-snippet-hunter",
    "category": "Marketing",
    "description": "Formats content to be eligible for featured snippets and SERP",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "seo-structure-architect",
    "category": "Marketing",
    "description": "Analyzes and optimizes content structure including header",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "server-management",
    "category": "Backend",
    "description": "Server management principles and decision-making. Process management, monitoring strategy, and scaling decisions. Teaches thinking, not commands.",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "service-mesh-expert",
    "category": "Security",
    "description": "\"Expert service mesh architect specializing in Istio, Linkerd, and cloud-native networking patterns. Masters traffic management, security policies, observability integration, and multi-cluster mesh con\"",
    "tags": [
      "Security",
      "Cloud"
    ],
    "categorySlug": "security"
  },
  {
    "name": "service-mesh-observability",
    "category": "Data & Analytics",
    "description": "Implement comprehensive observability for service meshes including distributed tracing, metrics, and visualization. Use when setting up mesh monitoring, debugging latency issues, or implementing SLOs for service communication.",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "sharp-edges",
    "category": "Backend",
    "description": "\"Identify error-prone APIs and dangerous configurations\"",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "shellcheck-configuration",
    "category": "Testing",
    "description": "Master ShellCheck static analysis configuration and usage for shell script quality. Use when setting up linting infrastructure, fixing code issues, or ensuring script portability.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "Shodan Reconnaissance and Pentesting",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"search for exposed devices on the internet,\" \"perform Shodan reconnaissance,\" \"find vulnerable services using Shodan,\" \"scan IP ranges with Shodan,\" or \"discover IoT devices and open ports.\" It provides comprehensive guidance for using Shodan's search engine, CLI, and API for penetration testing reconnaissance.",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "shopify-apps",
    "category": "Frontend",
    "description": "\"Expert patterns for Shopify app development including Remix/React Router apps, embedded apps with App Bridge, webhook handling, GraphQL Admin API, Polaris components, billing, and app extensions. Use when: shopify app, shopify, embedded app, polaris, app bridge.\"",
    "tags": [
      "React",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "shopify-automation",
    "category": "Automation",
    "description": "\"Automate Shopify tasks via Rube MCP (Composio): products, orders, customers, inventory, collections. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "shopify-development",
    "category": "Development",
    "description": "|",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "signup-flow-cro",
    "category": "Development",
    "description": "When the user wants to optimize signup, registration, account creation, or trial activation flows. Also use when the user mentions \"signup conversions,\" \"registration friction,\" \"signup form optimization,\" \"free trial signup,\" \"reduce signup dropoff,\" or \"account creation flow.\" For post-signup onboarding, see onboarding-cro. For lead capture forms (not account creation), see form-cro.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "similarity-search-patterns",
    "category": "Frontend",
    "description": "Implement efficient similarity search with vector databases. Use when building semantic search, implementing nearest neighbor queries, or optimizing retrieval performance.",
    "tags": [
      "UI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "skill-creator",
    "category": "Frontend",
    "description": "\"This skill should be used when the user asks to create a new skill, build a skill, make a custom skill, develop a CLI skill, or wants to extend the CLI with new capabilities. Automates the entire skill creation workflow from brainstorming to installation.\"",
    "tags": [
      "UI",
      "AI",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "skill-developer",
    "category": "AI & Agents",
    "description": "Create and manage Claude Code skills following Anthropic best practices. Use when creating new skills, modifying skill-rules.json, understanding trigger patterns, working with hooks, debugging skill activation, or implementing progressive disclosure. Covers skill structure, YAML frontmatter, trigger types (keywords, intent patterns, file paths, content patterns), enforcement levels (block, suggest, warn), hook mechanisms (UserPromptSubmit, PreToolUse), session tracking, and the 500-line rule.",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "skill-rails-upgrade",
    "category": "AI & Agents",
    "description": "\"Analyze Rails apps and provide upgrade assessments\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "skill-seekers",
    "category": "AI & Agents",
    "description": "\"-Automatically convert documentation websites, GitHub repositories, and PDFs into Claude AI skills in minutes.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "slack-automation",
    "category": "Frontend",
    "description": "\"Automate Slack messaging, channel management, search, reactions, and threads via Rube MCP (Composio). Send messages, search conversations, manage channels/users, and react to messages programmatically.\"",
    "tags": [
      "React",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "slack-bot-builder",
    "category": "Frontend",
    "description": "\"Build Slack apps using the Bolt framework across Python, JavaScript, and Java. Covers Block Kit for rich UIs, interactive components, slash commands, event handling, OAuth installation flows, and Workflow Builder integration. Focus on best practices for production-ready Slack apps. Use when: slack bot, slack app, bolt framework, block kit, slash command.\"",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "slack-gif-creator",
    "category": "AI & Agents",
    "description": "Knowledge and utilities for creating animated GIFs optimized for Slack. Provides constraints, validation tools, and animation concepts. Use when users request animated GIFs for Slack like \"make me a GIF of X doing Y for Slack.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "slo-implementation",
    "category": "Development",
    "description": "Define and implement Service Level Indicators (SLIs) and Service Level Objectives (SLOs) with error budgets and alerting. Use when establishing reliability targets, implementing SRE practices, or measuring service performance.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "SMTP Penetration Testing",
    "category": "Backend",
    "description": "This skill should be used when the user asks to \"perform SMTP penetration testing\", \"enumerate email users\", \"test for open mail relays\", \"grab SMTP banners\", \"brute force email credentials\", or \"assess mail server security\". It provides comprehensive techniques for testing SMTP server security.",
    "tags": [
      "Security",
      "AI",
      "Testing"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "social-content",
    "category": "Marketing",
    "description": "\"When the user wants help creating, scheduling, or optimizing social media content for LinkedIn, Twitter/X, Instagram, TikTok, Facebook, or other platforms. Also use when the user mentions 'LinkedIn post,' 'Twitter thread,' 'social media,' 'content calendar,' 'social scheduling,' 'engagement,' or 'viral content.' This skill covers content creation, repurposing, and platform-specific strategies.\"",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "software-architecture",
    "category": "Frontend",
    "description": "Guide for quality focused software architecture. This skill should be used when users want to write code, design architecture, analyze code, in any case that relates to software development.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "solidity-security",
    "category": "AI & Agents",
    "description": "Master smart contract security best practices to prevent common vulnerabilities and implement secure Solidity patterns. Use when writing smart contracts, auditing existing contracts, or implementing security measures for blockchain applications.",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "spark-optimization",
    "category": "Automation",
    "description": "Optimize Apache Spark jobs with partitioning, caching, shuffle optimization, and memory tuning. Use when improving Spark performance, debugging slow jobs, or scaling data processing pipelines.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "SQL Injection Testing",
    "category": "Backend",
    "description": "This skill should be used when the user asks to \"test for SQL injection vulnerabilities\", \"perform SQLi attacks\", \"bypass authentication using SQL injection\", \"extract database information through injection\", \"detect SQL injection flaws\", or \"exploit database query vulnerabilities\". It provides comprehensive techniques for identifying, exploiting, and understanding SQL injection attack vectors across different database systems.",
    "tags": [
      "Security",
      "Testing",
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "sql-optimization-patterns",
    "category": "Frontend",
    "description": "Master SQL query optimization, indexing strategies, and EXPLAIN analysis to dramatically improve database performance and eliminate slow queries. Use when debugging slow queries, designing database schemas, or optimizing application performance.",
    "tags": [
      "UI",
      "AI",
      "Database"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "sql-pro",
    "category": "Backend",
    "description": "Master modern SQL with cloud-native databases, OLTP/OLAP",
    "tags": [
      "Database",
      "Cloud"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "SQLMap Database Penetration Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"automate SQL injection testing,\" \"enumerate database structure,\" \"extract database credentials using sqlmap,\" \"dump tables and columns from a vulnerable database,\" or \"perform automated database penetration testing.\" It provides comprehensive guidance for using SQLMap to detect and exploit SQL injection vulnerabilities.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "square-automation",
    "category": "Automation",
    "description": "\"Automate Square tasks via Rube MCP (Composio): payments, orders, invoices, locations. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "SSH Penetration Testing",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"pentest SSH services\", \"enumerate SSH configurations\", \"brute force SSH credentials\", \"exploit SSH vulnerabilities\", \"perform SSH tunneling\", or \"audit SSH security\". It provides comprehensive SSH penetration testing methodologies and techniques.",
    "tags": [
      "Security",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "startup-analyst",
    "category": "Development",
    "description": "Expert startup business analyst specializing in market sizing,",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "startup-business-analyst-business-case",
    "category": "Development",
    "description": "Generate comprehensive investor-ready business case document with",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "startup-business-analyst-financial-projections",
    "category": "AI & Agents",
    "description": "Create detailed 3-5 year financial model with revenue, costs, cash",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "startup-business-analyst-market-opportunity",
    "category": "Development",
    "description": "Generate comprehensive market opportunity analysis with TAM/SAM/SOM",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "startup-financial-modeling",
    "category": "Development",
    "description": "This skill should be used when the user asks to \"create financial",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "startup-metrics-framework",
    "category": "Data & Analytics",
    "description": "This skill should be used when the user asks about \"key startup",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "stitch-ui-design",
    "category": "Frontend",
    "description": "Expert guide for creating effective prompts for Google Stitch AI UI design tool. Use when user wants to design UI/UX in Stitch, create app interfaces, generate mobile/web designs, or needs help crafting Stitch prompts. Covers prompt structure, specificity techniques, iteration strategies, and design-to-code workflows for Stitch by Google.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "stride-analysis-patterns",
    "category": "Security",
    "description": "Apply STRIDE methodology to systematically identify threats. Use when analyzing system security, conducting threat modeling sessions, or creating security documentation.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "stripe-automation",
    "category": "Automation",
    "description": "\"Automate Stripe tasks via Rube MCP (Composio): customers, charges, subscriptions, invoices, products, refunds. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "stripe-integration",
    "category": "Frontend",
    "description": "Implement Stripe payment processing for robust, PCI-compliant payment flows including checkout, subscriptions, and webhooks. Use when integrating Stripe payments, building subscription systems, or implementing secure checkout flows.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "subagent-driven-development",
    "category": "AI & Agents",
    "description": "Use when executing implementation plans with independent tasks in the current session",
    "tags": [
      "AI & Agents"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "supabase-automation",
    "category": "Backend",
    "description": "\"Automate Supabase database queries, table management, project administration, storage, edge functions, and SQL execution via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation",
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "superpowers-lab",
    "category": "Development",
    "description": "\"Lab environment for Claude superpowers\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "swiftui-expert-skill",
    "category": "Frontend",
    "description": "\"Write, review, or improve SwiftUI code following best practices for state management, view composition, performance, modern APIs, Swift concurrency, and iOS 26+ Liquid Glass adoption. Use when building new SwiftUI features, refactoring existing views, reviewing code quality, or adopting modern SwiftUI patterns.\"",
    "tags": [
      "UI",
      "API"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "systematic-debugging",
    "category": "AI & Agents",
    "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "systems-programming-rust-project",
    "category": "Testing",
    "description": "\"You are a Rust project architecture expert specializing in scaffolding production-ready Rust applications. Generate complete project structures with cargo tooling, proper module organization, testing\"",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "tailwind-design-system",
    "category": "Frontend",
    "description": "Build scalable design systems with Tailwind CSS, design tokens, component libraries, and responsive patterns. Use when creating component libraries, implementing design systems, or standardizing UI patterns.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "tailwind-patterns",
    "category": "Frontend",
    "description": "Tailwind CSS v4 principles. CSS-first configuration, container queries, modern patterns, design token architecture.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "tavily-web",
    "category": "Backend",
    "description": "Web search, content extraction, crawling, and research capabilities using Tavily API",
    "tags": [
      "API"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "tdd-orchestrator",
    "category": "Testing",
    "description": "Master TDD orchestrator specializing in red-green-refactor",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "tdd-workflow",
    "category": "Automation",
    "description": "Test-Driven Development workflow principles. RED-GREEN-REFACTOR cycle.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "tdd-workflows-tdd-cycle",
    "category": "Automation",
    "description": "\"Use when working with tdd workflows tdd cycle\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "tdd-workflows-tdd-green",
    "category": "AI & Agents",
    "description": "Implement the minimal code needed to make failing tests pass in the TDD green phase.",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "tdd-workflows-tdd-red",
    "category": "AI & Agents",
    "description": "Generate failing tests for the TDD red phase to define expected behavior and edge cases.",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "tdd-workflows-tdd-refactor",
    "category": "Automation",
    "description": "\"Use when working with tdd workflows tdd refactor\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "team-collaboration-issue",
    "category": "Automation",
    "description": "\"You are a GitHub issue resolution expert specializing in systematic bug investigation, feature implementation, and collaborative development workflows. Your expertise spans issue triage, root cause an\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "team-collaboration-standup-notes",
    "category": "AI & Agents",
    "description": "\"You are an expert team communication specialist focused on async-first standup practices, AI-assisted note generation from commit history, and effective remote team coordination patterns.\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "team-composition-analysis",
    "category": "Development",
    "description": "This skill should be used when the user asks to \"plan team",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "telegram-automation",
    "category": "Automation",
    "description": "\"Automate Telegram tasks via Rube MCP (Composio): send messages, manage chats, share photos/documents, and handle bot commands. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "telegram-bot-builder",
    "category": "Frontend",
    "description": "\"Expert in building Telegram bots that solve real problems - from simple automation to complex AI-powered bots. Covers bot architecture, the Telegram Bot API, user experience, monetization strategies, and scaling bots to thousands of users. Use when: telegram bot, bot api, telegram automation, chat bot telegram, tg bot.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "telegram-mini-app",
    "category": "Frontend",
    "description": "\"Expert in building Telegram Mini Apps (TWA) - web apps that run inside Telegram with native-like experience. Covers the TON ecosystem, Telegram Web App API, payments, user authentication, and building viral mini apps that monetize. Use when: telegram mini app, TWA, telegram web app, TON app, mini app.\"",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "temporal-python-pro",
    "category": "Automation",
    "description": "Master Temporal workflow orchestration with Python SDK. Implements",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "temporal-python-testing",
    "category": "AI & Agents",
    "description": "Test Temporal workflows with pytest, time-skipping, and mocking strategies. Covers unit testing, integration testing, replay testing, and local development setup. Use when implementing Temporal workflow tests or debugging test failures.",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "terraform-module-library",
    "category": "Frontend",
    "description": "Build reusable Terraform modules for AWS, Azure, and GCP infrastructure following infrastructure-as-code best practices. Use when creating infrastructure modules, standardizing cloud provisioning, or implementing reusable IaC components.",
    "tags": [
      "UI",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "terraform-skill",
    "category": "DevOps",
    "description": "\"Terraform infrastructure as code best practices\"",
    "tags": [
      "DevOps"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "terraform-specialist",
    "category": "DevOps",
    "description": "Expert Terraform/OpenTofu specialist mastering advanced IaC",
    "tags": [
      "DevOps"
    ],
    "categorySlug": "devops"
  },
  {
    "name": "test-automator",
    "category": "AI & Agents",
    "description": "Master AI-powered test automation with modern frameworks,",
    "tags": [
      "AI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "test-driven-development",
    "category": "Testing",
    "description": "Use when implementing any feature or bugfix, before writing implementation code",
    "tags": [
      "Testing"
    ],
    "categorySlug": "testing"
  },
  {
    "name": "test-fixing",
    "category": "Frontend",
    "description": "Run tests and systematically fix all failing tests using smart error grouping. Use when user asks to fix failing tests, mentions test failures, runs test suite and failures occur, or requests to make tests pass.",
    "tags": [
      "UI",
      "AI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "testing-patterns",
    "category": "Automation",
    "description": "Jest testing patterns, factory functions, mocking strategies, and TDD workflow. Use when writing unit tests, creating test factories, or following TDD red-green-refactor cycle.",
    "tags": [
      "Testing"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "theme-factory",
    "category": "Frontend",
    "description": "Toolkit for styling artifacts with a theme. These artifacts can be slides, docs, reportings, HTML landing pages, etc. There are 10 pre-set themes with colors/fonts that you can apply to any artifact that has been creating, or can generate a new theme on-the-fly.",
    "tags": [
      "Frontend"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "threat-mitigation-mapping",
    "category": "Security",
    "description": "Map identified threats to appropriate security controls and mitigations. Use when prioritizing security investments, creating remediation plans, or validating control effectiveness.",
    "tags": [
      "Security"
    ],
    "categorySlug": "security"
  },
  {
    "name": "threat-modeling-expert",
    "category": "Frontend",
    "description": "\"Expert in threat modeling methodologies, security architecture review, and risk assessment. Masters STRIDE, PASTA, attack trees, and security requirement extraction. Use for security architecture reviews, threat identification, and secure-by-design planning.\"",
    "tags": [
      "UI",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "threejs-skills",
    "category": "Development",
    "description": "\"Three.js skills for creating 3D elements and interactive experiences\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "tiktok-automation",
    "category": "Automation",
    "description": "\"Automate TikTok tasks via Rube MCP (Composio): upload/publish videos, post photos, manage content, and view user profiles/stats. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "todoist-automation",
    "category": "Automation",
    "description": "\"Automate Todoist task management, projects, sections, filtering, and bulk operations via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "tool-design",
    "category": "Frontend",
    "description": "\"Build tools that agents can use effectively, including architectural reduction patterns\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Top 100 Web Vulnerabilities Reference",
    "category": "Backend",
    "description": "This skill should be used when the user asks to \"identify web application vulnerabilities\", \"explain common security flaws\", \"understand vulnerability categories\", \"learn about injection attacks\", \"review access control weaknesses\", \"analyze API security issues\", \"assess security misconfigurations\", \"understand client-side vulnerabilities\", \"examine mobile and IoT security flaws\", or \"reference the OWASP-aligned vulnerability taxonomy\". Use this skill to provide comprehensive vulnerability definitions, root causes, impacts, and mitigation strategies across all major web security categories.",
    "tags": [
      "API",
      "Security",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "track-management",
    "category": "Development",
    "description": "Use this skill when creating, managing, or working with Conductor",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "trello-automation",
    "category": "Automation",
    "description": "\"Automate Trello boards, cards, and workflows via Rube MCP (Composio). Create cards, manage lists, assign members, and search across boards programmatically.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "trigger-dev",
    "category": "Frontend",
    "description": "\"Trigger.dev expert for background jobs, AI workflows, and reliable async execution with excellent developer experience and TypeScript-first design. Use when: trigger.dev, trigger dev, background task, ai background job, long running task.\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "turborepo-caching",
    "category": "Frontend",
    "description": "Configure Turborepo for efficient monorepo builds with local and remote caching. Use when setting up Turborepo, optimizing build pipelines, or implementing distributed caching.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "tutorial-engineer",
    "category": "Marketing",
    "description": "Creates step-by-step tutorials and educational content from code.",
    "tags": [
      "Marketing"
    ],
    "categorySlug": "marketing"
  },
  {
    "name": "twilio-communications",
    "category": "Frontend",
    "description": "\"Build communication features with Twilio: SMS messaging, voice calls, WhatsApp Business API, and user verification (2FA). Covers the full spectrum from simple notifications to complex IVR systems and multi-channel authentication. Critical focus on compliance, rate limits, and error handling. Use when: twilio, send SMS, text message, voice call, phone verification.\"",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "twitter-automation",
    "category": "Automation",
    "description": "\"Automate Twitter/X tasks via Rube MCP (Composio): posts, search, users, bookmarks, lists, media. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "typescript-advanced-types",
    "category": "Frontend",
    "description": "Master TypeScript's advanced type system including generics, conditional types, mapped types, template literals, and utility types for building type-safe applications. Use when implementing complex type logic, creating reusable type utilities, or ensuring compile-time type safety in TypeScript projects.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "typescript-expert",
    "category": "Development",
    "description": ">-",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "typescript-pro",
    "category": "Development",
    "description": "Master TypeScript with advanced types, generics, and strict type",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "ui-skills",
    "category": "Frontend",
    "description": "\"Opinionated, evolving constraints to guide agents when building interfaces\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ui-ux-designer",
    "category": "Frontend",
    "description": "Create interface designs, wireframes, and design systems. Masters",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "ui-visual-validator",
    "category": "Frontend",
    "description": "Rigorous visual validation expert specializing in UI testing,",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "unit-testing-test-generate",
    "category": "AI & Agents",
    "description": "Generate comprehensive, maintainable unit tests across languages with strong coverage and edge case focus.",
    "tags": [
      "AI",
      "Testing"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "unity-developer",
    "category": "Frontend",
    "description": "Build Unity games with optimized C# scripts, efficient rendering,",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "unity-ecs-patterns",
    "category": "Frontend",
    "description": "Master Unity ECS (Entity Component System) with DOTS, Jobs, and Burst for high-performance game development. Use when building data-oriented games, optimizing performance, or working with large entity counts.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "unreal-engine-cpp-pro",
    "category": "Frontend",
    "description": "Expert guide for Unreal Engine 5.x C++ development, covering UObject hygiene, performance patterns, and best practices.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "upgrading-expo",
    "category": "Development",
    "description": "\"Upgrade Expo SDK versions\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "upstash-qstash",
    "category": "Backend",
    "description": "\"Upstash QStash expert for serverless message queues, scheduled jobs, and reliable HTTP-based task delivery without managing infrastructure. Use when: qstash, upstash queue, serverless cron, scheduled http, message queue serverless.\"",
    "tags": [
      "Backend"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "using-git-worktrees",
    "category": "Development",
    "description": "Use when starting feature work that needs isolation from current workspace or before executing implementation plans - creates isolated git worktrees with smart directory selection and safety verification",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "using-neon",
    "category": "Frontend",
    "description": "\"Guides and best practices for working with Neon Serverless Postgres. Covers getting started, local development with Neon, choosing a connection method, Neon features, authentication (@neondatabase/auth), PostgREST-style data API (@neondatabase/neon-js), Neon CLI, and Neon's Platform API/SDKs. Use for any Neon-related questions.\"",
    "tags": [
      "UI",
      "API",
      "Security"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "using-superpowers",
    "category": "Frontend",
    "description": "Use when starting any conversation - establishes how to find and use skills, requiring Skill tool invocation before ANY response including clarifying questions",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "uv-package-manager",
    "category": "Automation",
    "description": "Master the uv package manager for fast Python dependency management, virtual environments, and modern Python project workflows. Use when setting up Python projects, managing dependencies, or optimizing Python development workflows with uv.",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "varlock-claude-skill",
    "category": "Development",
    "description": "\"Secure environment variable management ensuring secrets are never exposed in Claude sessions, terminals, logs, or git commits\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "vector-database-engineer",
    "category": "Backend",
    "description": "\"Expert in vector databases, embedding strategies, and semantic search implementation. Masters Pinecone, Weaviate, Qdrant, Milvus, and pgvector for RAG applications, recommendation systems, and similar\"",
    "tags": [
      "Database"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "vector-index-tuning",
    "category": "Development",
    "description": "Optimize vector index performance for latency, recall, and memory. Use when tuning HNSW parameters, selecting quantization strategies, or scaling vector search infrastructure.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "vercel-automation",
    "category": "AI & Agents",
    "description": "\"Automate Vercel tasks via Rube MCP (Composio): manage deployments, domains, DNS, env vars, projects, and teams. Always search tools first for current schemas.\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "vercel-deploy-claimable",
    "category": "Frontend",
    "description": "\"Deploy applications and websites to Vercel. Use this skill when the user requests deployment actions such as 'Deploy my app', 'Deploy this to production', 'Create a preview deployment', 'Deploy and give me the link', or 'Push this live'. No authentication required - returns preview URL and claimable deployment link.\"",
    "tags": [
      "UI",
      "Security",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "vercel-deployment",
    "category": "Automation",
    "description": "\"Expert knowledge for deploying to Vercel with Next.js Use when: vercel, deploy, deployment, hosting, production.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "verification-before-completion",
    "category": "Frontend",
    "description": "Use when about to claim work is complete, fixed, or passing, before committing or creating PRs - requires running verification commands and confirming output before making any success claims; evidence before assertions always",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "vexor",
    "category": "Development",
    "description": "\"Vector-powered CLI for semantic file search with a Claude/Codex skill\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "viral-generator-builder",
    "category": "Frontend",
    "description": "\"Expert in building shareable generator tools that go viral - name generators, quiz makers, avatar creators, personality tests, and calculator tools. Covers the psychology of sharing, viral mechanics, and building tools people can't resist sharing with friends. Use when: generator tool, quiz maker, name generator, avatar creator, viral tool.\"",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "voice-agents",
    "category": "Backend",
    "description": "\"Voice agents represent the frontier of AI interaction - humans speaking naturally with AI systems. The challenge isn't just speech recognition and synthesis, it's achieving natural conversation flow with sub-800ms latency while handling interruptions, background noise, and emotional nuance.  This skill covers two architectures: speech-to-speech (OpenAI Realtime API, lowest latency, most natural) and pipeline (STT→LLM→TTS, more control, easier to debug). Key insight: latency is the constraint. Hu\"",
    "tags": [
      "API",
      "AI"
    ],
    "categorySlug": "backend"
  },
  {
    "name": "voice-ai-development",
    "category": "Frontend",
    "description": "\"Expert in building voice AI applications - from real-time voice agents to voice-enabled apps. Covers OpenAI Realtime API, Vapi for voice agents, Deepgram for transcription, ElevenLabs for synthesis, LiveKit for real-time infrastructure, and WebRTC fundamentals. Knows how to build low-latency, production-ready voice experiences. Use when: voice ai, voice agent, speech to text, text to speech, realtime voice.\"",
    "tags": [
      "UI",
      "API",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "voice-ai-engine-development",
    "category": "Frontend",
    "description": "\"Build real-time conversational AI voice engines using async worker pipelines, streaming transcription, LLM agents, and TTS synthesis with interrupt handling and multi-provider support\"",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "vulnerability-scanner",
    "category": "AI & Agents",
    "description": "Advanced vulnerability analysis principles. OWASP 2025, Supply Chain Security, attack surface mapping, risk prioritization.",
    "tags": [
      "Security",
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "wcag-audit-patterns",
    "category": "Frontend",
    "description": "Conduct WCAG 2.2 accessibility audits with automated testing, manual verification, and remediation guidance. Use when auditing websites for accessibility, fixing WCAG violations, or implementing accessible design patterns.",
    "tags": [
      "UI",
      "Automation",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "web-artifacts-builder",
    "category": "Frontend",
    "description": "Suite of tools for creating elaborate, multi-component claude.ai HTML artifacts using modern frontend web technologies (React, Tailwind CSS, shadcn/ui). Use for complex artifacts requiring state management, routing, or shadcn/ui components - not for simple single-file HTML/JSX artifacts.",
    "tags": [
      "UI",
      "React",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "web-design-guidelines",
    "category": "Frontend",
    "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\".",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "web-performance-optimization",
    "category": "Development",
    "description": "\"Optimize website and web application performance including loading speed, Core Web Vitals, bundle size, caching strategies, and runtime performance\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "web3-testing",
    "category": "Frontend",
    "description": "Test smart contracts comprehensively using Hardhat and Foundry with unit tests, integration tests, and mainnet forking. Use when testing Solidity contracts, setting up blockchain test suites, or validating DeFi protocols.",
    "tags": [
      "UI",
      "AI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "webapp-testing",
    "category": "Frontend",
    "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs.",
    "tags": [
      "UI",
      "Testing"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "webflow-automation",
    "category": "Automation",
    "description": "\"Automate Webflow CMS collections, site publishing, page management, asset uploads, and ecommerce orders via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "whatsapp-automation",
    "category": "Automation",
    "description": "\"Automate WhatsApp Business tasks via Rube MCP (Composio): send messages, manage templates, upload media, and handle contacts. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "Windows Privilege Escalation",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"escalate privileges on Windows,\" \"find Windows privesc vectors,\" \"enumerate Windows for privilege escalation,\" \"exploit Windows misconfigurations,\" or \"perform post-exploitation privilege escalation.\" It provides comprehensive guidance for discovering and exploiting privilege escalation vulnerabilities in Windows environments.",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "Wireshark Network Traffic Analysis",
    "category": "Development",
    "description": "This skill should be used when the user asks to \"analyze network traffic with Wireshark\", \"capture packets for troubleshooting\", \"filter PCAP files\", \"follow TCP/UDP streams\", \"detect network anomalies\", \"investigate suspicious traffic\", or \"perform protocol analysis\". It provides comprehensive techniques for network packet capture, filtering, and analysis using Wireshark.",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "WordPress Penetration Testing",
    "category": "Security",
    "description": "This skill should be used when the user asks to \"pentest WordPress sites\", \"scan WordPress for vulnerabilities\", \"enumerate WordPress users, themes, or plugins\", \"exploit WordPress vulnerabilities\", or \"use WPScan\". It provides comprehensive WordPress security assessment methodologies.",
    "tags": [
      "Security",
      "Testing"
    ],
    "categorySlug": "security"
  },
  {
    "name": "workflow-automation",
    "category": "AI & Agents",
    "description": "\"Workflow automation is the infrastructure that makes AI agents reliable. Without durable execution, a network hiccup during a 10-step payment flow means lost money and angry customers. With it, workflows resume exactly where they left off.  This skill covers the platforms (n8n, Temporal, Inngest) and patterns (sequential, parallel, orchestrator-worker) that turn brittle scripts into production-grade automation.  Key insight: The platforms make different tradeoffs. n8n optimizes for accessibility\"",
    "tags": [
      "AI",
      "Automation"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "workflow-orchestration-patterns",
    "category": "Frontend",
    "description": "Design durable workflows with Temporal for distributed systems. Covers workflow vs activity separation, saga patterns, state management, and determinism constraints. Use when building long-running processes, distributed transactions, or microservice orchestration.",
    "tags": [
      "UI",
      "AI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "workflow-patterns",
    "category": "Automation",
    "description": "Use this skill when implementing tasks according to Conductor's TDD",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "wrike-automation",
    "category": "Automation",
    "description": "\"Automate Wrike project management via Rube MCP (Composio): create tasks/folders, manage projects, assign work, and track progress. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "writing-plans",
    "category": "Frontend",
    "description": "Use when you have a spec or requirements for a multi-step task, before touching code",
    "tags": [
      "UI"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "writing-skills",
    "category": "AI & Agents",
    "description": "Use when creating, updating, or improving agent skills.",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "x-article-publisher-skill",
    "category": "Development",
    "description": "\"Publish articles to X/Twitter\"",
    "tags": [
      "Development"
    ],
    "categorySlug": "development"
  },
  {
    "name": "xlsx",
    "category": "Data & Analytics",
    "description": "\"Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data analysis and visualization in spreadsheets, or (5) Recalculating formulas\"",
    "tags": [
      "Data & Analytics"
    ],
    "categorySlug": "data"
  },
  {
    "name": "Cross-Site Scripting and HTML Injection Testing",
    "category": "Frontend",
    "description": "This skill should be used when the user asks to \"test for XSS vulnerabilities\", \"perform cross-site scripting attacks\", \"identify HTML injection flaws\", \"exploit client-side injection vulnerabilities\", \"steal cookies via XSS\", or \"bypass content security policies\". It provides comprehensive techniques for detecting, exploiting, and understanding XSS and HTML injection attack vectors in web applications.",
    "tags": [
      "Security",
      "Testing",
      "Cloud"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "youtube-automation",
    "category": "Automation",
    "description": "\"Automate YouTube tasks via Rube MCP (Composio): upload videos, manage playlists, search content, get analytics, and handle comments. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "youtube-summarizer",
    "category": "AI & Agents",
    "description": "\"Extract transcripts from YouTube videos and generate comprehensive, detailed summaries using intelligent analysis frameworks\"",
    "tags": [
      "AI"
    ],
    "categorySlug": "ai"
  },
  {
    "name": "zapier-make-patterns",
    "category": "Frontend",
    "description": "\"No-code automation democratizes workflow building. Zapier and Make (formerly Integromat) let non-developers automate business processes without writing code. But no-code doesn't mean no-complexity - these platforms have their own patterns, pitfalls, and breaking points.  This skill covers when to use which platform, how to build reliable automations, and when to graduate to code-based solutions. Key insight: Zapier optimizes for simplicity and integrations (7000+ apps), Make optimizes for power \"",
    "tags": [
      "UI",
      "API",
      "Automation"
    ],
    "categorySlug": "frontend"
  },
  {
    "name": "zendesk-automation",
    "category": "Automation",
    "description": "\"Automate Zendesk tasks via Rube MCP (Composio): tickets, users, organizations, replies. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "zoho-crm-automation",
    "category": "Automation",
    "description": "\"Automate Zoho CRM tasks via Rube MCP (Composio): create/update records, search contacts, manage leads, and convert leads. Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  },
  {
    "name": "zoom-automation",
    "category": "Automation",
    "description": "\"Automate Zoom meeting creation, management, recordings, webinars, and participant tracking via Rube MCP (Composio). Always search tools first for current schemas.\"",
    "tags": [
      "Automation"
    ],
    "categorySlug": "automation"
  }
]
